xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
/** @violates @ref Adc_c_REF_5 Identifier clash */
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
 /* Check if source file and DET header file are of the same version */
 #if (ADC_DEV_ERROR_DETECT == STD_ON)
    #if ((ADC_AR_RELEASE_MAJOR_VERSION_C != DET_AR_RELEASE_MAJOR_VERSION) || \
         (ADC_AR_RELEASE_MINOR_VERSION_C != DET_AR_RELEASE_MINOR_VERSION) \
        )
    #error "AutoSar Version Numbers of Adc.c and Det.h are different"
    #endif
 #endif
#endif

/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/


/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/

/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/


/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/
#ifdef ADC_PRECOMPILE_SUPPORT
#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_c_REF_1 Only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_c_REF_6 Repeated include file MemMap.h*/
#include "Adc_MemMap.h"

/** @violates @ref Adc_c_REF_11 MISRA 2004 Required Rule 8.7, objects shall be defined at block scope */
extern CONST(Adc_ConfigType, ADC_CONST) Adc_PBCfgVariantPredefined;

#define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_c_REF_1 Only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_c_REF_6 Repeated include file MemMap.h*/
#include "Adc_MemMap.h"
#endif
/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/

#define ADC_START_SEC_VAR_INIT_UNSPECIFIED
/** @violates @ref Adc_c_REF_1 Only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_c_REF_6 Repeated include file MemMap.h*/
#include "Adc_MemMap.h"

/**
* @brief          Global Configuration Pointer.
* @details        Data structure containing the set of configuration parameters required for
*                 initializing the ADC Driver and ADC HW Unit(s).
*
*/
P2CONST(Adc_ConfigType, ADC_VAR, ADC_APPL_CONST) Adc_pCfgPtr = NULL_PTR;

#if (ADC_VALIDATE_GLOBAL_CALL == STD_ON)
/**
* @brief          Global Driver Status.
* @details        Data structure containing the ADC driver status
*                 uninit, during init or already init.
*
*/
static VAR(Adc_GlobalStateType, ADC_VAR) Adc_eGlobalState = ADC_STATE_UNINIT;
#endif /* ADC_VALIDATE_GLOBAL_CALL == STD_ON */

#if (ADC_DUAL_CLOCK_MODE == STD_ON)
#if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)
/**
* @brief          Clock mode in use
* @details        The current used clock mode: normal or alternate clock.
*/
VAR(Adc_DualClockModeType, AUTOMATIC) Adc_eClockMode = ADC_NORMAL;
#endif /*if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)*/
#endif /*if (ADC_DUAL_CLOCK_MODE == STD_ON)*/

#define ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
/** @violates @ref Adc_c_REF_1 Only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_c_REF_6 Repeated include file MemMap.h*/
#include "Adc_MemMap.h"

#define ADC_START_SEC_VAR_NO_INIT_UNSPECIFIED
/** @violates @ref Adc_c_REF_1 Only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_c_REF_6 Repeated include file MemMap.h*/
#include "Adc_MemMap.h"

/**
* @brief          Group status array structure
* @details        Array to hold all the group status information.
* @violates @ref Adc_c_REF_3 internal linkage vs external linkage.
*/
VAR(Adc_GroupStatusType, ADC_VAR) Adc_aGroupStatus[ADC_MAX_GROUPS];

/**
* @brief          Unit status structure
* @details        Structure for the unit status.
* @violates @ref Adc_c_REF_3 internal linkage vs external linkage.
* @violates @ref Adc_c_REF_11 MISRA 2004 Required Rule 8.7, objects shall be defined at block scope
*/
VAR(Adc_UnitStatusType, ADC_VAR) Adc_aUnitStatus[ADC_MAX_HW_UNITS];

/**
* @brief          Runtime group channels array
* @details        Hold the runtime group channels.
* @violates @ref Adc_c_REF_3 internal linkage vs external linkage.
* @violates @ref Adc_c_REF_11 MISRA 2004 Required Rule 8.7, objects shall be defined at block scope
*/
#if (ADC_SETCHANNEL_API == STD_ON)
VAR(Adc_RuntimeGroupChannelType, ADC_VAR) Adc_aRuntimeGroupChannel[ADC_MAX_GROUPS];
#endif

#if (ADC_POWER_STATE_SUPPORTED == STD_ON) || defined(__DOXYGEN__)
static VAR(Adc_PowerStateType, ADC_VAR) Adc_eCurrentState;
static VAR(Adc_PowerStateType, ADC_VAR) Adc_eTargetState;
#endif /* (ADC_POWER_STATE_SUPPORTED == STD_ON) */

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
/**
* @brief          Unit status structure
* @details        Structure for the unit status.
*
*/
VAR(Adc_NcmrType, ADC_VAR) Adc_aNCMRxMask[ADC_NO_OF_ENABLE_CH_DISABLE_CH_GROUPS];
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */

#define ADC_STOP_SEC_VAR_NO_INIT_UNSPECIFIED
/** @violates @ref Adc_c_REF_1 Only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_c_REF_6 Repeated include file MemMap.h*/
#include "Adc_MemMap.h"

#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
#define ADC_START_SEC_VAR_NO_INIT_8
/** @violates @ref Adc_c_REF_1 Only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_c_REF_6 Repeated include file MemMap.h*/
#include "Adc_MemMap.h"
/**
* @brief          Active BCTU triggers for the group in the HW queue
* @details        This array is used in Adc_Adcdig_EnableCtuTrigger. For the group currently in the HW queue,
*                 if an element is 1 in this array, the corresponding trigger from the group's configuration structure
*                 has been activated.
* @violates @ref Adc_c_REF_3 internal linkage vs external linkage.
*/
VAR(uint8, ADC_VAR) Adc_au8BctuGroupTriggersActive[ADC_MAX_HW_UNITS][ADC_MAX_HADRWARE_TRIGGERS];

#define ADC_STOP_SEC_VAR_NO_INIT_8
/** @violates @ref Adc_c_REF_1 Only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_c_REF_6 Repeated include file MemMap.h*/
#include "Adc_MemMap.h"
#endif /* ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON */

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/
#define ADC_START_SEC_CODE
/** @violates @ref Adc_c_REF_1 Only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_c_REF_6 Repeated include file MemMap.h*/
#include "Adc_MemMap.h"

