xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
#if ((ADC_VALIDATE_PARAMS == STD_ON) && \
     ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || \
      (ADC_HW_TRIGGER_API == STD_ON) || \
      (ADC_ENABLE_CTUTRIG_NONAUTO_API ==STD_ON) || \
      (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) \
     ) \
    )
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateExtraParams
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(uint32, AUTOMATIC) u32ErrorIdList,
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif

#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCallAndGroup
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
#if (ADC_VALIDATE_NOTIFY_CAPABILITY == STD_ON)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_NotifyCapablity
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif
#endif

#if (ADC_DEV_ERROR_DETECT == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ReportDetError
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(uint8, AUTOMATIC) u8ErrorId
);
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ReportDetRuntimeError
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(uint8, AUTOMATIC) u8ErrorId
);
#endif

#if ((ADC_DEV_ERROR_DETECT == STD_ON) && \
     ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || \
      (ADC_HW_TRIGGER_API == STD_ON) || \
      (ADC_ENABLE_CTUTRIG_NONAUTO_API ==STD_ON) || \
      (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) \
     ) \
    )
static FUNC(void, ADC_CODE) Adc_ReportValidationError
(
    P2VAR(Adc_ValidationResultType, AUTOMATIC, ADC_APPL_DATA) pResult,
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(uint8, AUTOMATIC) u8ErrorId
);
#endif

#if (ADC_VALIDATE_GLOBAL_CALL == STD_ON)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateGloballCall
(
    VAR(uint8, AUTOMATIC) u8ServiceId
);
#endif

#if (ADC_VALIDATE_PARAMS == STD_ON)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidatePtrInit
(
    P2CONST(Adc_ConfigType, AUTOMATIC, ADC_APPL_CONST) pConfigPtr
);

LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidatePtr
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    P2CONST(void, AUTOMATIC, ADC_APPL_CONST) pPtrVal
);

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON))
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ValidateBufferUninit
(
    P2VAR(Adc_ValidationResultType, AUTOMATIC, ADC_APPL_DATA) pReturnValue,
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || \
      (ADC_HW_TRIGGER_API == STD_ON) || \
      (ADC_ENABLE_CTUTRIG_NONAUTO_API ==STD_ON) || \
      (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) \
    )
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ValidateTriggerSrc
(
    P2VAR(Adc_ValidationResultType, AUTOMATIC, ADC_APPL_DATA) pReturnValue,
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON))
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ValidateQueueNotFull
(
    P2VAR(Adc_ValidationResultType, AUTOMATIC, ADC_APPL_DATA) pReturnValue,
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif


#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON) || \
    (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ValidateConvMode
(
    P2VAR(Adc_ValidationResultType, AUTOMATIC, ADC_APPL_DATA) pReturnValue,
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ValidateEnableDisbleGroupList
(
    P2VAR(Adc_ValidationResultType, AUTOMATIC, ADC_APPL_DATA) pReturnValue,
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
);

LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateEnableDisbleIdList
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_ChannelType, AUTOMATIC) Channel
);
#endif

#if (CTUV2_ENABLE_TRIGGER_CONFIGURATION_APIS == STD_ON)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCallAndTrigger
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(uint8, AUTOMATIC) u8Trigger
);
#endif

#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCtuTriggerSrc
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwTriggerTimerType, AUTOMATIC) Trigger
);
#endif

#ifdef ADC_VALIDATE_APP_BUFFER_ALIGNMENT
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateSetupBufferAlignment
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    P2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) pDataBufferPtr
);
#endif

#endif /* ADC_VALIDATE_PARAMS == STD_ON */

#if (ADC_SET_MODE_API == STD_ON)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateSetMode
(
    VAR(Adc_SetModeType, AUTOMATIC) eSetMode
);
#endif

#if (ADC_VALIDATE_GLOBAL_CALL == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_EndValidateGloballCall
(
    VAR(Std_ReturnType, AUTOMATIC) ValidCall,
    VAR(uint8, AUTOMATIC) u8ServiceId
);
#endif

#if (ADC_VALIDATE_STATE == STD_ON)

#if (ADC_DEINIT_API == STD_ON) || defined(__DOXYGEN__)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateDeInitNotBusy(void);
#endif /* (ADC_DEINIT_API == STD_ON) || defined(__DOXYGEN__) */

LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateSetupBufferNotBusy
(
    VAR(Adc_GroupType, AUTOMATIC) Group
);

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || defined(__DOXYGEN__)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateStartGroupConvNotBusy
(
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || defined(__DOXYGEN__) */

