xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
#if ((ADC_HW_TRIGGER_API == STD_ON) || defined(__DOXYGEN__))
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateEnableHwTriggNotBusy
(
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif /* ((ADC_HW_TRIGGER_API == STD_ON) || defined(__DOXYGEN__)) */

LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateNotIdle
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
);

#if ((ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE) && ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || defined(__DOXYGEN__)))
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateNotBusyWithPrio
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(boolean, AUTOMATIC) bImplicitly
);
#endif /* ((ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE) && ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || defined(__DOXYGEN__))) */

#if (ADC_HW_TRIGGER_API == STD_ON)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateNotBusyEnableHwTrig
(
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateNotBusyEnableCtuTrig
(
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif /* (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) */

#if ((ADC_PRIORITY_IMPLEMENTATION == ADC_PRIORITY_NONE) && (ADC_ENABLE_START_STOP_GROUP_API == STD_ON))
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE)Adc_ValidateNotBusyNoPrio
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(boolean, AUTOMATIC) bImplicitly
);
#endif /* ((ADC_PRIORITY_IMPLEMENTATION == ADC_PRIORITY_NONE) && (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)) */
#endif /* (ADC_VALIDATE_STATE == STD_ON) */

#if (((ADC_VALIDATE_STATE == STD_ON) && (ADC_HW_TRIGGER_API == STD_ON) && (ADC_ENABLE_QUEUING == STD_OFF)) \
      || (((ADC_VALIDATE_STATE == STD_ON) && ((ADC_DEINIT_API == STD_ON) || defined(__DOXYGEN__)))         \
      || (ADC_CALIBRATION == STD_ON) || (ADC_DUAL_CLOCK_MODE == STD_ON)  || (ADC_SET_MODE_API == STD_ON)   \
         ) \
    )
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateNotBusyNoQueue
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(uint8, AUTOMATIC) u8ServiceId
);
#endif

#if (((ADC_VALIDATE_STATE == STD_ON) && ((ADC_DEINIT_API == STD_ON) || defined(__DOXYGEN__))) \
      || (ADC_CALIBRATION == STD_ON) || (ADC_DUAL_CLOCK_MODE == STD_ON) || (ADC_SET_MODE_API == STD_ON) \
    )
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCheckGroupNotConversion
(
    VAR(uint8, AUTOMATIC) u8ServiceId
);
#endif /* (((ADC_VALIDATE_STATE == STD_ON) ... */


#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCallAndGroup
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif

#if (((ADC_GET_INJECTED_CONVERSION_STATUS_API == STD_ON) || (ADC_CALIBRATION == STD_ON) || (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)) && \
     (ADC_VALIDATE_CALL_AND_UNIT == STD_ON) \
    )
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCallAndUnit
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
);
#endif

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_InitGroupsStatus(void);

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_InitUnitStatus(void);

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) && (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE))
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_InsertIntoQueue
(
    CONST(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group
);
#endif

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusStartConversion
(
    CONST(Adc_GroupType, AUTOMATIC) Group,
    CONST(Adc_HwUnitType, AUTOMATIC) Unit
);

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusStopConversion
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
);
#endif

#if (ADC_READ_GROUP_API == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusReadGroupNoInt
(
    CONST(Adc_GroupType, AUTOMATIC) Group,
    CONST(boolean, AUTOMATIC) bFlag
);

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusReadGroupInt
(
    CONST(Adc_GroupType, AUTOMATIC) Group
);
#endif

#if (ADC_HW_TRIGGER_API == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusEnableHardware
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
);

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusDisableHardware
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
);
#endif

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusAfterGetStream
(
    VAR(Adc_GroupType, AUTOMATIC) Group
);

#if ((ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) && (ADC_DEV_ERROR_DETECT == STD_ON))
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateUnitActive
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
);

LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateCtuControlMode
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
);
#endif

#if (ADC_POWER_STATE_SUPPORTED == STD_ON) || defined(__DOXYGEN__)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateAndPtr
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) pResult
);
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateIdleState
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) pResult
);
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidatePowerStateSupport
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_PowerStateType, AUTOMATIC) ePowerState,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) pResult
);
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidatePowerStatePrepare
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) pResult
);
#endif /* (ADC_POWER_STATE_SUPPORTED == STD_ON) */

/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/
#if (ADC_DEV_ERROR_DETECT == STD_ON)
/**
* @brief      This function reports an error to the Det module and records the failure in the local structure.
* @details    This function reports an error to the Det module and records the failure in the local structure.
*
* @param[in]  u8ServiceId       The service id of the caller function
* @param[in]  u8ErrorId         The error id to be reported
*
* @return     void
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ReportDetError
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(uint8, AUTOMATIC) u8ErrorId
)
{
    /* ADC377 */
    /** @violates @ref Adc_c_REF_12 The error information will be verified in application */
    Det_ReportError((uint16)ADC_MODULE_ID, (uint8)0U, u8ServiceId, u8ErrorId);
}
/**
* @brief      This function reports an runtime error to the Det module and records the failure in the local structure.
* @details    This function reports an runtime error to the Det module and records the failure in the local structure.
*
* @param[in]  u8ServiceId       The service id of the caller function
* @param[in]  u8ErrorId         The error id to be reported
*
* @return     void
* @implements  Adc_ReportDetRuntimeError_Activity
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ReportDetRuntimeError
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(uint8, AUTOMATIC) u8ErrorId
)
{
    (void)Det_ReportRuntimeError((uint16)ADC_MODULE_ID, (uint8)0U, u8ServiceId, u8ErrorId);
}
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

#if ((ADC_DEV_ERROR_DETECT == STD_ON) && \
     ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || \
      (ADC_HW_TRIGGER_API == STD_ON) || \
      (ADC_ENABLE_CTUTRIG_NONAUTO_API ==STD_ON) || \
      (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) \
     ) \
    )
/**
* @brief      This function reports an error to the Det module and records the failure in the local structure.
* @details    This function reports an error to the Det module and records the failure in the local structure.
*
* @param[in]  u8ServiceId       The service id of the caller function
* @param[in]  u8ErrorId         The error id to be reported
* @param[in]  pResult           Pointer to the structure where the failure must be recorded
*
* @return     void
*/
static FUNC(void, ADC_CODE) Adc_ReportValidationError
(
    P2VAR(Adc_ValidationResultType, AUTOMATIC, ADC_APPL_DATA) pResult,
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(uint8, AUTOMATIC) u8ErrorId
)
{
    pResult->bEndValidations = (boolean)TRUE;
    pResult->ValidParams = (Std_ReturnType)E_NOT_OK;

    Adc_ReportDetError(u8ServiceId, u8ErrorId);
}
#endif

#if (ADC_VALIDATE_GLOBAL_CALL == STD_ON)
/**
* @brief      This function validates the global call parameters.
* @details    This service is a non reentrant function used for validating the calls for functions
*               like Adc_Init, Adc_DeInit.
*
* @param[in]  u8ServiceId       The service id of the caller function
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           Valid call
* @retval     E_NOT_OK:       Invalid call
*
* @api
*
* @note       Non Re-entrant function.
* @implements  Adc_ValidateGlobalCall_Activity
*
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateGloballCall
(
    VAR(uint8, AUTOMATIC) u8ServiceId
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;

    if (ADC_STATE_UNINIT == Adc_eGlobalState)
    {
        if (ADC_INIT_ID == u8ServiceId)
        {
            ValidState = (Std_ReturnType)E_OK;
        }
        else
        {
            /* ADC154 */
            Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_UNINIT);
        }
    }
    else
    {
        if (ADC_INIT_ID == u8ServiceId)
        {
            /* Error: ADC already initialized */
            /* ADC107 */
            Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_ALREADY_INITIALIZED);
        }
        else
        {
            ValidState = (Std_ReturnType)E_OK;
        }
    }

    return ValidState;
}
#endif /* ADC_VALIDATE_GLOBAL_CALL == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
/**
* @brief      This function validates the global call parameters.
* @details    This service is a non reentrant function used for validating parameters
*               for Adc_Init.
*
* @param[in]  pConfigPtr   Pointer to configuration set in Variant PB
*                         (Variant PC requires a NULL_PTR).
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           Valid parameter
* @retval     E_NOT_OK:       Invalid parameter
*
* @api
*
* @note       Non Reentrant function.
*
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidatePtrInit
(
    P2CONST(Adc_ConfigType, AUTOMATIC, ADC_APPL_CONST) pConfigPtr
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidPtr = (Std_ReturnType)E_OK;

#ifdef ADC_PRECOMPILE_SUPPORT
    /* ADC344 */
    if (NULL_PTR != pConfigPtr)
#else
    /* ADC343 */
    if (NULL_PTR == pConfigPtr)
#endif /* ADC_PRECOMPILE_SUPPORT */
    {
        ValidPtr = (Std_ReturnType)E_NOT_OK;
        Adc_ReportDetError((uint8)ADC_INIT_ID, (uint8) ADC_E_PARAM_POINTER);
    }
    return ValidPtr;
}

/**
* @brief      This function validates the pointer is NULL or not
* @details    This service is a reentrant function used for validating parameters
*
* @param[in]  PtrVal          Pointer to validate
* @param[in]  u8ServiceId     The service id of the caller function
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           Valid parameter
* @retval     E_NOT_OK:       Invalid parameter
*
* @api
*
* @note       ...
* ADC_VALUEREADGROUP_ID
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidatePtr
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    P2CONST(void, AUTOMATIC, ADC_APPL_CONST) pPtrVal
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidPtr = (Std_ReturnType)E_OK;

