xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
    /* ADC458, ADC457, CPR-MCAL-718.adc */
    if (NULL_PTR == pPtrVal)
    {
        ValidPtr = (Std_ReturnType)E_NOT_OK;
        Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_PARAM_POINTER);
    }

    return ValidPtr;
}

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON))
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ValidateBufferUninit
(
    P2VAR(Adc_ValidationResultType, AUTOMATIC, ADC_APPL_DATA) pReturnValue,
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    switch (u8ServiceId)
    {
        case ADC_STARTGROUPCONVERSION_ID:
#if (ADC_HW_TRIGGER_API == STD_ON)
        case ADC_ENABLEHARDWARETRIGGER_ID:
#endif /* ADC_HW_TRIGGER_API == STD_ON */
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if (NULL_PTR == Adc_pCfgPtr->pGroups[Group].pResultsBufferPtr[Group])
            {
                /* ADC425, ADC424 */
                Adc_ReportValidationError(pReturnValue, u8ServiceId, (uint8)ADC_E_BUFFER_UNINIT);
            }
            break;
        }
        default:
        {
            break;
        }
    }
}
#endif

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || \
      (ADC_HW_TRIGGER_API == STD_ON) || \
      (ADC_ENABLE_CTUTRIG_NONAUTO_API ==STD_ON) || \
      (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) \
    )
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ValidateTriggerSrc
(
    P2VAR(Adc_ValidationResultType, AUTOMATIC, ADC_APPL_DATA) pReturnValue,
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    switch (u8ServiceId)
    {
        case ADC_STARTGROUPCONVERSION_ID:
        case ADC_STOPGROUPCONVERSION_ID:
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
        case ADC_ENABLE_CHANNEL_ID:
        case ADC_DISABLE_CHANNEL_ID:
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if (ADC_TRIGG_SRC_SW != Adc_pCfgPtr->pGroups[Group].eTriggerSource)
            {
                /* ADC164, ADC133 */
                Adc_ReportValidationError(pReturnValue, u8ServiceId, (uint8)ADC_E_WRONG_TRIGG_SRC);
            }
            break;
        }
#if (ADC_HW_TRIGGER_API == STD_ON)
        case ADC_ENABLEHARDWARETRIGGER_ID:
        case ADC_DISABLEHARDWARETRIGGER_ID:
#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
        case ADC_ENABLECTUTRIGGER_ID:
        case ADC_DISABLECTUTRIGGER_ID:
#endif /* ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON */
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if (ADC_TRIGG_SRC_SW == (Adc_pCfgPtr->pGroups[Group].eTriggerSource))
            {
                /* ADC136, ADC137 */
                Adc_ReportValidationError(pReturnValue, u8ServiceId, (uint8)ADC_E_WRONG_TRIGG_SRC);
            }
            break;
        }
#endif /* ADC_HW_TRIGGER_API == STD_ON */
        default:
        {
            break;
        }
    }
}
#endif

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON))
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ValidateQueueNotFull
(
    P2VAR(Adc_ValidationResultType, AUTOMATIC, ADC_APPL_DATA) pReturnValue,
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{

    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
#if (ADC_HW_TRIGGER_API == STD_ON)
    VAR(Adc_GroupConvType, AUTOMATIC) eType;
    VAR(Adc_QueueIndexType, AUTOMATIC) HwInjectedQueueIndex;
    VAR(Adc_QueueIndexType, AUTOMATIC) HwNormalQueueIndex;
#endif /* ADC_HW_TRIGGER_API == STD_ON */

    switch (u8ServiceId)
    {
        case ADC_STARTGROUPCONVERSION_ID:
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic shall be the only allowed form of pointer arithmetic */
            if (ADC_CONV_TYPE_NORMAL == Adc_pCfgPtr->pGroups[Group].eType)
            {
                if (Adc_aUnitStatus[Unit].SwNormalQueueIndex >= ADC_QUEUE_MAX_DEPTH_MAX)
                {
                    Adc_ReportValidationError(pReturnValue, u8ServiceId, (uint8)ADC_E_QUEUE_FULL);
                }
            }
            break;
        }
#if (ADC_HW_TRIGGER_API == STD_ON)
        case ADC_ENABLEHARDWARETRIGGER_ID:
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            eType = Adc_pCfgPtr->pGroups[Group].eType;
            HwInjectedQueueIndex = Adc_aUnitStatus[Unit].HwInjectedQueueIndex;
            HwNormalQueueIndex = Adc_aUnitStatus[Unit].HwNormalQueueIndex;
            /* Get HW queue sizes */
            if (((ADC_CONV_TYPE_INJECTED == eType) && ( HwInjectedQueueIndex >= (Adc_QueueIndexType)ADC_HW_QUEUE)) || \
                ((ADC_CONV_TYPE_NORMAL == eType) && ( HwNormalQueueIndex >= (Adc_QueueIndexType)ADC_HW_QUEUE)) \
               )
            {
                Adc_ReportValidationError(pReturnValue, u8ServiceId, (uint8)ADC_E_QUEUE_FULL);
            }
            break;
        }
#endif /* ADC_HW_TRIGGER_API == STD_ON */

        default:
        {
            break;
        }
    }
}
#endif

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON) || \
    (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ValidateConvMode
(
    P2VAR(Adc_ValidationResultType, AUTOMATIC, ADC_APPL_DATA) pReturnValue,
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    switch (u8ServiceId)
    {
#if (ADC_HW_TRIGGER_API == STD_ON)
        case ADC_ENABLEHARDWARETRIGGER_ID:
        case ADC_DISABLEHARDWARETRIGGER_ID:
#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
        case ADC_ENABLECTUTRIGGER_ID:
        case ADC_DISABLECTUTRIGGER_ID:
#endif /* ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON */
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if (ADC_CONV_MODE_CONTINUOUS == (Adc_pCfgPtr->pGroups[Group].eMode))
            {
                /* ADC282, ADC281 */
                Adc_ReportValidationError(pReturnValue, u8ServiceId, (uint8)ADC_E_WRONG_CONV_MODE);
            }
            break;
        }
#endif /* ADC_HW_TRIGGER_API == STD_ON */
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
        case ADC_ENABLE_CHANNEL_ID:
        case ADC_DISABLE_CHANNEL_ID:
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if(ADC_CONV_TYPE_INJECTED == Adc_pCfgPtr->pGroups[Group].eType)
            {
                Adc_ReportValidationError(pReturnValue, u8ServiceId, (uint8)ADC_E_WRONG_CONV_MODE);
            }
            break;
        }
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */

        default:
        {
            break;
        }
    }
}
#endif

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
/** @brief @implements Adc_ValidateEnableDisbleGroupList_Activity */
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_ValidateEnableDisbleGroupList
(
    P2VAR(Adc_ValidationResultType, AUTOMATIC, ADC_APPL_DATA) pReturnValue,
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    switch (u8ServiceId)
    {
        case ADC_ENABLE_CHANNEL_ID:
        case ADC_DISABLE_CHANNEL_ID:
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if((Adc_GroupType)ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX == \
               Adc_pCfgPtr->pGroups[Group].EnableChDisableChGroupIndex
              )
            {
                Adc_ReportValidationError(pReturnValue, u8ServiceId, (uint8)ADC_E_WRONG_ENABLE_CH_DISABLE_CH_GROUP);
            }
            break;
        }
        default:
        {
            break;
        }
    }
}
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
/** @brief @implements Adc_ValidateEnableDisbleIdList_Activity */
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateEnableDisbleIdList
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_ChannelType, AUTOMATIC) Channel
)
{
    P2CONST(Adc_GroupDefType, AUTOMATIC, ADC_APPL_CONST) pGroupChIndexPtr;
    VAR(Adc_ChannelIndexType, AUTOMATIC) Index = 0U;
    VAR(boolean, AUTOMATIC) bChannelFound = (boolean)FALSE;
    VAR(Std_ReturnType, AUTOMATIC) ReturnValue = (Std_ReturnType)E_NOT_OK;

    switch (u8ServiceId)
    {
        case ADC_ENABLE_CHANNEL_ID:
        case ADC_DISABLE_CHANNEL_ID:
        {
            /** @violates @ref Adc_c_REF_4 Array indexing */
            pGroupChIndexPtr = Adc_pCfgPtr->pGroups[Group].pAssignment;
            /* Check if ChannelId is valid: assigned to that group */
            /** @violates @ref Adc_c_REF_4 Array indexing */
            for (Index = 0U; Index < Adc_pCfgPtr->pGroups[Group].AssignedChannelCount; Index++)
            {
                /** @violates @ref Adc_c_REF_4 Array indexing */
                if ((Adc_ChannelType)Channel == (Adc_ChannelType)pGroupChIndexPtr[Index])
                {
                    bChannelFound = (boolean)TRUE;
                    break;
                }
            }
            if ((boolean)TRUE == bChannelFound)
            {
                ReturnValue = (Std_ReturnType)E_OK;
            }
            else
            {
                Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_WRONG_ENABLE_CH_DISABLE_CH_ID);
            }
            break;
        }

        default:
        {
            break;
        }
    }
    return ReturnValue;
}
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || \
      (ADC_HW_TRIGGER_API == STD_ON) || \
      (ADC_ENABLE_CTUTRIG_NONAUTO_API ==STD_ON) || \
      (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) \
    )
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateExtraParams
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(uint32, AUTOMATIC) u32ErrorIdList,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(Adc_ValidationResultType, AUTOMATIC) ValidationStatus;

    ValidationStatus.bEndValidations = (boolean)FALSE;
    ValidationStatus.ValidParams = (Std_ReturnType)E_OK;

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON))
    if ((0U != (u32ErrorIdList&ADC_E_BUFFER_UNINIT_LIST)) && ((boolean)FALSE == ValidationStatus.bEndValidations))
    {
        /** @violates @ref Adc_c_REF_7 It is needed for calculation value of go back space for source address.*/
        Adc_ValidateBufferUninit(&ValidationStatus, u8ServiceId, Group);
    }
#endif
    if ((0U != (u32ErrorIdList&ADC_E_WRONG_TRIGG_SRC_LIST)) && ((boolean)FALSE == ValidationStatus.bEndValidations))
    {
       /** @violates @ref Adc_c_REF_7 It is needed for calculation value of go back space for source address.*/
       Adc_ValidateTriggerSrc(&ValidationStatus, u8ServiceId, Group);
    }
#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON))
    if ((0U != (u32ErrorIdList&ADC_E_QUEUE_FULL_LIST)) && ((boolean)FALSE == ValidationStatus.bEndValidations))
    {
        /** @violates @ref Adc_c_REF_7 It is needed for calculation value of go back space for source address.*/
        Adc_ValidateQueueNotFull(&ValidationStatus, u8ServiceId, Group);
    }
#endif
#if ((ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) || (ADC_HW_TRIGGER_API == STD_ON) || (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON))
    if ((0U != (u32ErrorIdList&ADC_E_WRONG_CONV_MODE_LIST)) && ((boolean)FALSE == ValidationStatus.bEndValidations))
    {
        /** @violates @ref Adc_c_REF_7 It is needed for calculation value of go back space for source address.*/
        Adc_ValidateConvMode(&ValidationStatus, u8ServiceId, Group);
    }
#endif

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    if ((0U != (u32ErrorIdList&ADC_E_WRONG_ENABLE_CH_DISABLE_CH_GROUP_LIST)) && ((boolean)FALSE == ValidationStatus.bEndValidations))
    {
        /** @violates @ref Adc_c_REF_7 It is needed for calculation value of go back space for source address.*/
        Adc_ValidateEnableDisbleGroupList(&ValidationStatus, u8ServiceId, Group);
    }
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */

    return ValidationStatus.ValidParams;
}
#endif

#if (CTUV2_ENABLE_TRIGGER_CONFIGURATION_APIS == STD_ON)
/** @brief @implements Adc_ValidateCallAndTrigger_Activity */
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCallAndTrigger
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(uint8, AUTOMATIC) u8Trigger
)
{
    VAR(Std_ReturnType, AUTOMATIC) ReturnValue = (Std_ReturnType)E_OK;

    if (NULL_PTR == Adc_pCfgPtr)
    {
        Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_UNINIT);
        ReturnValue = (Std_ReturnType)E_NOT_OK;
    }
    else if ((uint8)CTU2_MAX_TRIGGERS_U8 <= u8Trigger)
    {
        Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_WRONG_CTUV2_TRIGGER);
        ReturnValue = (Std_ReturnType)E_NOT_OK;
    }
    else
    {
        /* do nothing for MISRA*/
    }
    return ReturnValue;
}
#endif /* CTUV2_ENABLE_TRIGGER_CONFIGURATION_APIS == STD_ON */

#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
/** @brief @implements Adc_ValidateCtuTriggerSrc_Activity */
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCtuTriggerSrc
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwTriggerTimerType, AUTOMATIC) Trigger
)
{
    VAR(Adc_HwTriggerTimerType, AUTOMATIC) Index = 0U;
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = 0U;
    VAR(Std_ReturnType, AUTOMATIC) ReturnValue = (Std_ReturnType)E_NOT_OK;

    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    for(Index = 0U; Index < Adc_pCfgPtr->pGroups[Group].AssignedTriggerCount; Index++)
    {
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        if(Trigger == Adc_pCfgPtr->pGroups[Group].pHwResource[Index])
        {
            /* This trigger is configured for this group */
            ReturnValue = (Std_ReturnType)E_OK;
            break;
        }
    }
    if ((Std_ReturnType)E_NOT_OK == ReturnValue)
    {
        /* Report error to DET */
        Adc_ReportDetError(u8ServiceId, (uint8) ADC_E_PARAM_TRIGGER);
    }
    else
    {
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
        /* Trigger should not be already enabled*/
        if ((ADC_ENABLECTUTRIGGER_ID == u8ServiceId) && (0U != Adc_au8BctuGroupTriggersActive[Unit][Index]))
        {
            /* This trigger has already been for this group */
            ReturnValue = (Std_ReturnType)E_NOT_OK;
            Adc_ReportDetError(u8ServiceId, (uint8) ADC_E_PARAM_TRIGGER);
        }
        /* Trigger should be enabled*/
        else if ((ADC_DISABLECTUTRIGGER_ID == u8ServiceId) && (0U == Adc_au8BctuGroupTriggersActive[Unit][Index]))
        {
            /* This trigger was not enabled for this group */
            ReturnValue = (Std_ReturnType)E_NOT_OK;
            Adc_ReportDetError(u8ServiceId, (uint8) ADC_E_PARAM_TRIGGER);
        }
        else
        {
            /* Do nothing for Misra*/
        }
    }
    return ReturnValue;
}
#endif /* ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON */

#ifdef ADC_VALIDATE_APP_BUFFER_ALIGNMENT
/**
* @brief        This function validates the setup buffer to be aligned to 4 bytes.
* @details      This function validates the setup buffer to be aligned to 4 bytes.
*
* @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The setup buffer is aligned
* @retval     E_NOT_OK:       The setup buffer is not aligned
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateSetupBufferAlignment
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    P2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) pDataBufferPtr
)
{
    VAR(Std_ReturnType, AUTOMATIC) Valid = (Std_ReturnType)E_OK;
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr = NULL_PTR;
    /** @violates @ref Adc_c_REF_13 cast from unsigned long to pointer */
    /** @violates @ref Adc_c_REF_14 A cast should not be performed between a pointer type and an integral type. */
    VAR(uint32, AUTOMATIC) u32DataBufferAddr = (uint32)pDataBufferPtr;

    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    pGroupPtr = &(Adc_pCfgPtr->pGroups[Group]);
    /* If the internal buffer is not used(streaming, without interrupt and limit checking are not used),
       the application buffer should be aligned to 4 bytes */
    if((ADC_ACCESS_MODE_STREAMING != pGroupPtr->eAccessMode) &&
       ((uint8)STD_ON != pGroupPtr->u8AdcWithoutInterrupt)
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        &&((boolean)TRUE != pGroupPtr->bAdcGroupLimitcheck)
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
        &&((u32DataBufferAddr & 0x00000003UL) != 0UL)
      )
    {
        Valid = (Std_ReturnType)E_NOT_OK;
    }
    return Valid;
}
#endif /* ADC_VALIDATE_APP_BUFFER_ALIGNMENT */

#endif /* ADC_VALIDATE_PARAMS == STD_ON */

