xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
    /* CPR-MCAL-792.adc, CPR-MCAL-793.adc, CPR-MCAL-794.adc, PR-MCAL-3186.adc */
    /* Check for ongoing conversions */
    if ((NoGroupsInSwNormalQueue > (Adc_QueueIndexType)0)
        || (NoGroupsInSwInjectedQueue > (Adc_QueueIndexType)0)
#if (ADC_HW_TRIGGER_API == STD_ON)
        || (NoGroupsInHwInjectedQueue > (Adc_QueueIndexType)0)
        || (NoGroupsInHwNormalQueue > (Adc_QueueIndexType)0)
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
       )
    {
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        /* ADC321 */
        Adc_ReportDetRuntimeError(u8ServiceId, (uint8)ADC_E_BUSY);

#else
        /* Avoid compiler warning */
        (void)u8ServiceId;
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
        ErrorFound = (Std_ReturnType)E_NOT_OK;
    }
    return ErrorFound;
}
#endif

#if ((ADC_HW_TRIGGER_API == STD_ON) && (ADC_VALIDATE_STATE == STD_ON))
/**
* @brief        This function validates the state of a group when the hardware trigger is enabled.
* @details      This service is a non reentrant function used for validating the state of a group
*                when the hardware trigger is enabled.
*
 @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateNotBusyEnableHwTrig
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
#if (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_OFF)
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwNormalQueue = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwInjectedQueue = 0U;
    VAR(Adc_GroupConvType, AUTOMATIC) eGroupType = ADC_CONV_TYPE_NORMAL;
    VAR(Adc_HwTriggeringType, AUTOMATIC) eHwTriggering;
#endif /* ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_OFF */
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInHwNormalQueue = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInHwInjectedQueue = 0U;
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic shall be the only allowed form of pointer arithmetic */
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;

    /* Get HW and SW queue sizes */
#if (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_OFF)
    NoGroupsInSwNormalQueue = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    NoGroupsInSwInjectedQueue = Adc_aUnitStatus[Unit].SwInjectedQueueIndex;
    /** @violates @ref Adc_c_REF_4 Array indexing */
    eGroupType = Adc_pCfgPtr->pGroups[Group].eType;
#endif /* ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON */
    NoGroupsInHwInjectedQueue = Adc_aUnitStatus[Unit].HwInjectedQueueIndex;
    NoGroupsInHwNormalQueue = Adc_aUnitStatus[Unit].HwNormalQueueIndex;

#if (ADC_ENABLE_QUEUING == STD_OFF)
    if ((Std_ReturnType)E_OK == Adc_ValidateNotBusyNoQueue(Unit, ADC_ENABLEHARDWARETRIGGER_ID))
#endif /* ADC_ENABLE_QUEUING == STD_OFF  */
    {
#if (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON)
        /* The queue is not empty, check the type of the group that will be (or not) en-queued */
        /* Different group type or more than one regular group not allowed */
        /** @violates @ref Adc_c_REF_4 Array indexing */
        if (((0U != NoGroupsInHwInjectedQueue) || (0U != NoGroupsInHwNormalQueue)) && \
            ((Adc_aUnitStatus[Unit].eHwQueueGroupType != Adc_pCfgPtr->pGroups[Group].IsMHTGroup) || \
             ((Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE == Adc_aUnitStatus[Unit].eHwQueueGroupType)
            )
           )
        {
            /* ADC353 */
            Adc_ReportDetRuntimeError((uint8)ADC_ENABLEHARDWARETRIGGER_ID, (uint8)ADC_E_BUSY);
        }

        else if ((ADC_HWTRIGGER_ENABLED == Adc_aGroupStatus[Group].eHwTriggering) ||
                 ((uint8)ADC_HW_QUEUE <= NoGroupsInHwInjectedQueue) ||
                 ((uint8)ADC_HW_QUEUE <= NoGroupsInHwNormalQueue)
                )
#else
        eHwTriggering = Adc_aGroupStatus[Group].eHwTriggering;
        /** @violates @ref Adc_c_REF_4 Array indexing */
        if (((ADC_HWTRIGGER_ENABLED == eHwTriggering) && ((0U != NoGroupsInHwInjectedQueue) || (0U != NoGroupsInHwNormalQueue))) || \
            ((ADC_CONV_TYPE_INJECTED == eGroupType) && ((0U != NoGroupsInSwInjectedQueue) || (0U != NoGroupsInHwNormalQueue))) || \
            ((ADC_CONV_TYPE_NORMAL == eGroupType) && ((0U != NoGroupsInHwInjectedQueue) || (0U != NoGroupsInSwNormalQueue) )) \
           )

#endif /* ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON */
        {
            Adc_ReportDetRuntimeError((uint8)ADC_ENABLEHARDWARETRIGGER_ID, (uint8)ADC_E_BUSY);
        }
        else
        {
            ValidState = (Std_ReturnType)E_OK;
        }
    }
    return ValidState;
}
#endif /* (ADC_HW_TRIGGER_API == STD_ON).. */

#if ((ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) && (ADC_VALIDATE_STATE == STD_ON))
/**
* @brief        This function validates the state of a group when the ctu trigger is enabled.
* @details      This service is a non reentrant function used for validating the state of a group
*                when the ctu trigger is enabled.
*
 @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateNotBusyEnableCtuTrig
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
    VAR(Adc_GroupType, AUTOMATIC) GroupInQueue;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
#if (ADC_ENABLE_QUEUING == STD_OFF)
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwNormalQueue = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwInjectedQueue = 0U;
#endif /* ADC_ENABLE_QUEUING == STD_OFF */

#if (ADC_ENABLE_QUEUING == STD_OFF)
    /* Get HW and SW queue sizes */
    NoGroupsInSwNormalQueue = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    NoGroupsInSwInjectedQueue = Adc_aUnitStatus[Unit].SwInjectedQueueIndex;

