xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
    /* Check for ongoing conversions */
    if ((0U != NoGroupsInSwNormalQueue) || (0U != NoGroupsInSwInjectedQueue))
    {
       Adc_ReportDetRuntimeError((uint8)ADC_ENABLECTUTRIGGER_ID, (uint8)ADC_E_BUSY);
    }
    else
#endif /* ADC_ENABLE_QUEUING == STD_OFF */
    {
        if (0U != Adc_aUnitStatus[Unit].HwInjectedQueueIndex)
        {
            GroupInQueue = Adc_aUnitStatus[Unit].HwInjectedQueue[0];
            if ((Group != GroupInQueue) || (ADC_HWTRIGGER_ENABLED == Adc_aGroupStatus[GroupInQueue].eHwTriggering))
            {
                Adc_ReportDetRuntimeError((uint8)ADC_ENABLECTUTRIGGER_ID, (uint8)ADC_E_BUSY);
            }
            else
            {
                ValidState = (Std_ReturnType)E_OK;
            }
        }
        else
        {
            ValidState = (Std_ReturnType)E_OK;
        }
    }
    return ValidState;
}
#endif /* (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) && (ADC_VALIDATE_STATE == STD_ON) */

#if ((ADC_PRIORITY_IMPLEMENTATION == ADC_PRIORITY_NONE) && (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) && (ADC_VALIDATE_STATE == STD_ON))
/**
* @brief        This function validates the state of a group when priorities are not used.
* @details      This service is a non reentrant function used for validating the state of a group
*                when priorities are not used
*
* @param[in]    Unit          The hardware unit
* @param[in]    Group         The group id
* @param[in]    bImplicitly   Indicates if the group can be implicitly stopped
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE)Adc_ValidateNotBusyNoPrio
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(boolean, AUTOMATIC) bImplicitly
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
#if (ADC_ENABLE_QUEUING == STD_OFF)
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
    VAR(boolean, AUTOMATIC) bQueuesEmpty = (boolean)TRUE;
#else /* ADC_ENABLE_QUEUING == STD_ON */
    VAR(Adc_StatusType, AUTOMATIC) eConversion;
#endif

#if (ADC_ENABLE_QUEUING == STD_OFF)
    if (Adc_aUnitStatus[Unit].SwNormalQueueIndex != (Adc_QueueIndexType)0)
    {
        bQueuesEmpty = (boolean)FALSE;
    }
    if (Adc_aUnitStatus[Unit].SwInjectedQueueIndex != (Adc_QueueIndexType)0)
    {
        bQueuesEmpty = (boolean)FALSE;
    }
    #if (STD_ON==ADC_HW_TRIGGER_API)
    if (Adc_aUnitStatus[Unit].HwInjectedQueueIndex != (Adc_QueueIndexType)0)
    {
        bQueuesEmpty = (boolean)FALSE;
    }
    if (Adc_aUnitStatus[Unit].HwNormalQueueIndex != (Adc_QueueIndexType)0)
    {
        bQueuesEmpty = (boolean)FALSE;
    }
    #endif

    /* Check if any queue is non-empty*/
    /* ADC346, ADC426 */
    if ((boolean)FALSE == bQueuesEmpty)
    {
        Adc_ReportDetRuntimeError((uint8)ADC_STARTGROUPCONVERSION_ID, (uint8)ADC_E_BUSY);
    }
    else
    {
        ValidState = (Std_ReturnType)E_OK;
    }
    (void)bImplicitly;
    (void)Group;
#else /* ADC_ENABLE_QUEUING == STD_ON */
    /* ADC351 */
    eConversion = Adc_aGroupStatus[Group].eConversion;
    /* ADC338 */
    if (((boolean)FALSE == bImplicitly) && (ADC_IDLE != eConversion))
    {
        Adc_ReportDetRuntimeError((uint8)ADC_STARTGROUPCONVERSION_ID, (uint8)ADC_E_BUSY);
    }
    /* ADC338 */
    else if (((boolean)TRUE == bImplicitly) && (ADC_IDLE != eConversion) && \
             (ADC_STREAM_COMPLETED != eConversion) \
            )
    {
        Adc_ReportDetRuntimeError((uint8)ADC_STARTGROUPCONVERSION_ID, (uint8)ADC_E_BUSY);
    }
    else
    {
        ValidState = (Std_ReturnType)E_OK;
    }
#endif /* ADC_ENABLE_QUEUING  */
    return ValidState;
}
#endif /* (ADC_PRIORITY_IMPLEMENTATION == ADC_PRIORITY_NONE)... */

#if (((ADC_VALIDATE_STATE == STD_ON) && ((ADC_DEINIT_API == STD_ON) || defined(__DOXYGEN__))) \
      || (ADC_CALIBRATION == STD_ON) || (ADC_DUAL_CLOCK_MODE == STD_ON) || (ADC_SET_MODE_API == STD_ON) \
    )
/**
* @brief        This function validates the state of all group.
* @details      This service is a non reentrant function used for validating the state of all group
*
* @param[in]    u8ServiceId     The service id of the caller function
*
* @return       Std_ReturnType  Standard return type.
* @retval       E_OK:           The call means that at leat one group is not busy
* @retval       E_NOT_OK:       The call means that at leat one group is busy
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCheckGroupNotConversion
(
    VAR(uint8, AUTOMATIC) u8ServiceId
)
{
    VAR(Adc_StatusType, AUTOMATIC) eConversion;
    VAR(Adc_GroupType,AUTOMATIC) GroupId;
    VAR(Std_ReturnType, AUTOMATIC) ErrorFound = (Std_ReturnType)E_OK;

    for (GroupId = 0U; GroupId < (Adc_GroupType)Adc_pCfgPtr->GroupCount; GroupId++)
    {
        eConversion = Adc_aGroupStatus[GroupId].eConversion;
        /*  Check if ADC is still converting */
        /* ADC112 */
        if((ADC_IDLE != eConversion) && (ADC_STREAM_COMPLETED != eConversion))
        {
#if (ADC_DEV_ERROR_DETECT == STD_ON)
            Adc_ReportDetRuntimeError(u8ServiceId, (uint8)ADC_E_BUSY);
#else
            (void)u8ServiceId;
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
            ErrorFound =  (Std_ReturnType)E_NOT_OK;
        }
    }
    return ErrorFound;
}
#endif /* (((ADC_VALIDATE_STATE == STD_ON) ... */

#if (ADC_VALIDATE_STATE == STD_ON)
#if (ADC_DEINIT_API == STD_ON) || defined(__DOXYGEN__)
/**
* @brief        This function validates the state of a group when De-init (should not be busy).
* @details      This service is a non reentrant function used for validating the state of a group
*
* @param[in]    void
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateDeInitNotBusy(void)
{
    VAR(Std_ReturnType, AUTOMATIC) ErrorFound = (Std_ReturnType)E_OK;
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
    VAR(Adc_HwUnitType, AUTOMATIC) HwIndex;
    VAR(Adc_HwUnitType, AUTOMATIC) Unit;

    for(HwIndex = 0U; HwIndex < Adc_pCfgPtr->Misc.Adc_MaxHwCfg; HwIndex++)
    {
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Unit = Adc_pCfgPtr->pAdc[HwIndex].AdcHardwareUnitId;
        ErrorFound = Adc_ValidateNotBusyNoQueue(Unit, ADC_DEINIT_ID);
        if ((Std_ReturnType)E_NOT_OK == ErrorFound)
        {
            break;
        }
    }
    if ((Std_ReturnType)E_OK == ErrorFound)
    {
        if ((Std_ReturnType)E_OK == Adc_ValidateCheckGroupNotConversion(ADC_DEINIT_ID))
        {
            ValidState = (Std_ReturnType)E_OK;
        }
    }

    return ValidState;
}
#endif /* (ADC_DEINIT_API == STD_ON) || defined(__DOXYGEN__) */
/**
* @brief        This function validates the state of a group when Setup result buffer (should not be busy).
* @details      This service is a non reentrant function used for validating the state of a group
*
* @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateSetupBufferNotBusy
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;

    if (ADC_IDLE != Adc_aGroupStatus[Group].eConversion)
    {
        /* ADC433 */
        Adc_ReportDetRuntimeError(ADC_SETUPRESULTBUFFER_ID, (uint8)ADC_E_BUSY);
    }
    else
    {
        ValidState = (Std_ReturnType)E_OK;
    }
    return ValidState;
}

