xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || defined(__DOXYGEN__)
/**
* @brief        This function validates the state of a group when start group conversion (should not be busy).
* @details      This service is a non reentrant function used for validating the state of a group
*
* @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateStartGroupConvNotBusy
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
    VAR(boolean, AUTOMATIC) bImplicitly = (boolean)FALSE;
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = 0U;
#if (STD_ON == ADC_HW_TRIGGER_API)
    VAR(Adc_GroupConvType, AUTOMATIC) eType;
    VAR(Adc_QueueIndexType, AUTOMATIC) SwInjectedQueueIndex;
    VAR(Adc_QueueIndexType, AUTOMATIC) HwInjectedQueueIndex;
    VAR(Adc_QueueIndexType, AUTOMATIC) HwNormalQueueIndex;
#endif /* #if (STD_ON==ADC_HW_TRIGGER_API) */

    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if ((ADC_CONV_MODE_ONESHOT == Adc_pCfgPtr->pGroups[Group].eMode) || \
        ((ADC_CONV_MODE_CONTINUOUS == Adc_pCfgPtr->pGroups[Group].eMode) && \
         (ADC_ACCESS_MODE_STREAMING == Adc_pCfgPtr->pGroups[Group].eAccessMode) && \
         (ADC_STREAM_BUFFER_LINEAR == Adc_pCfgPtr->pGroups[Group].eBufferMode)
        )
       )
    {
        /* The current group can be implicitly stopped */
        bImplicitly = (boolean)TRUE;
    }

    /* Get the unit to which the group belongs to */
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
#if (STD_ON == ADC_HW_TRIGGER_API)
    /** @violates @ref Adc_c_REF_4 Array indexing */
    eType = Adc_pCfgPtr->pGroups[Group].eType;
    SwInjectedQueueIndex = Adc_aUnitStatus[Unit].SwInjectedQueueIndex;
    HwInjectedQueueIndex = Adc_aUnitStatus[Unit].HwInjectedQueueIndex;
    HwNormalQueueIndex = Adc_aUnitStatus[Unit].HwNormalQueueIndex;

    /* SW Injected conversions should be entertained only if there are no other HW or CTU injected chains enabled*/
    /** @violates @ref Adc_c_REF_4 Array indexing */
    if((SwInjectedQueueIndex != (Adc_QueueIndexType)0) || \
       (((Adc_GroupConvType)ADC_CONV_TYPE_INJECTED == eType) && \
        (HwInjectedQueueIndex != (Adc_QueueIndexType)0) \
       ) || \
       (((Adc_GroupConvType)ADC_CONV_TYPE_NORMAL == eType) && \
        (HwNormalQueueIndex != (Adc_QueueIndexType)0) \
       ) \
      )
#else
    /* Check for ongoing injected conversion */
    if (Adc_aUnitStatus[Unit].SwInjectedQueueIndex != (Adc_QueueIndexType)0)
#endif /* #if (STD_ON==ADC_HW_TRIGGER_API) */
    {
        /* Return the Group status as IDLE */
        Adc_ReportDetRuntimeError(ADC_STARTGROUPCONVERSION_ID, (uint8)ADC_E_BUSY);
    }
#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
    else if ((boolean)TRUE == Adc_aUnitStatus[Unit].bCtuControlOngoing)
    {
        Adc_ReportDetRuntimeError(ADC_STARTGROUPCONVERSION_ID, (uint8)ADC_E_BUSY);
    }
#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */
    else
    {
#if (ADC_PRIORITY_IMPLEMENTATION == ADC_PRIORITY_NONE)
        ValidState = Adc_ValidateNotBusyNoPrio(Group, bImplicitly);
#else /* ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE */
        ValidState = Adc_ValidateNotBusyWithPrio(Group, bImplicitly);
#endif  /* ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE */
    }
    return ValidState;
}
#endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || defined(__DOXYGEN__) */

#if ((ADC_HW_TRIGGER_API == STD_ON) || defined(__DOXYGEN__))
/**
* @brief        This function validates the state of a group when enable hw trigger (should not be busy).
* @details      This service is a non reentrant function used for validating the state of a group
*
* @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateEnableHwTriggNotBusy
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = 0U;
#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */

#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
    /* ADC349 */
    if ((boolean)TRUE == Adc_aUnitStatus[Unit].bCtuControlOngoing)
    {
        Adc_ReportDetRuntimeError(ADC_ENABLEHARDWARETRIGGER_ID, (uint8)ADC_E_BUSY);
    }
    else
#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */
#if (ADC_HW_TRIGGER_API == STD_ON)
    {
        ValidState = Adc_ValidateNotBusyEnableHwTrig(Group);
    }
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
    return ValidState;
}
#endif /* (ADC_HW_TRIGGER_API == STD_ON) || defined(__DOXYGEN__) */
#endif /* ADC_VALIDATE_STATE == STD_ON */


#if (ADC_VALIDATE_STATE == STD_ON)
/**
* @brief        This function validates the state of a group (should not be idle).
* @details      This service is a non reentrant function used for validating the state of a group
*
* @param[in]    u8ServiceId     The service id of the caller function
* @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateNotIdle
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_OK;
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = 0U;

    switch (u8ServiceId)
    {
#if (ADC_READ_GROUP_API == STD_ON)
        case ADC_VALUEREADGROUP_ID:
        {
            if (ADC_IDLE == Adc_aGroupStatus[Group].eConversion)
            {
                if(ADC_NOT_YET_CONVERTED == Adc_aGroupStatus[Group].eAlreadyConverted)
                {
                    /* ADC388 */
                    Adc_ReportDetRuntimeError(u8ServiceId, (uint8)ADC_E_IDLE);
                    ValidState = (Std_ReturnType)E_NOT_OK;
                }
            }
            break;
        }
#endif /* ADC_READ_GROUP_API == STD_ON */
        case ADC_STOPGROUPCONVERSION_ID:
        {
            if (ADC_IDLE == Adc_aGroupStatus[Group].eConversion)
            {
                /* ADC241 */
                Adc_ReportDetRuntimeError(u8ServiceId, (uint8)ADC_E_IDLE);
                ValidState = (Std_ReturnType)E_NOT_OK;
            }
            else
            {
                VAR(Adc_QueueIndexType, AUTOMATIC) SwNormalQueueIndex;
                VAR(Adc_QueueIndexType, AUTOMATIC) SwInjectedQueueIndex;

                /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic shall be the only allowed form of pointer arithmetic */
                Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
                SwNormalQueueIndex = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
                SwInjectedQueueIndex = Adc_aUnitStatus[Unit].SwInjectedQueueIndex;

