xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
                if ((Group == Adc_aUnitStatus[Unit].SwNormalQueue[0]) && \
                    (SwNormalQueueIndex > 0U) && \
                    (SwInjectedQueueIndex > 0U) \
                   )
                {
                    Adc_ReportDetRuntimeError(u8ServiceId, (uint8)ADC_E_BUSY);
                    ValidState = (Std_ReturnType)E_NOT_OK;
                }
            }
            break;
        }
#if (ADC_HW_TRIGGER_API == STD_ON)
        case ADC_DISABLEHARDWARETRIGGER_ID:
        {
            /* ADC304 */
            if (ADC_HWTRIGGER_DISABLED == Adc_aGroupStatus[Group].eHwTriggering)
            {
                Adc_ReportDetRuntimeError(u8ServiceId, (uint8)ADC_E_IDLE);
                ValidState = (Std_ReturnType)E_NOT_OK;
            }
            break;
        }
#endif /* ADC_HW_TRIGGER_API == STD_ON */
        case ADC_GETSTREAMLASTPOINTER_ID:
        {
            /* ADC215 */
             if (ADC_IDLE == Adc_aGroupStatus[Group].eConversion)
             {
                Adc_ReportDetRuntimeError(u8ServiceId, (uint8)ADC_E_IDLE);
                 ValidState = (Std_ReturnType)E_NOT_OK;
             }
            break;
        }
        default:
        {
            break;
        }
    }

    return ValidState;
}
#endif

#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
/**
* @brief        This function validates the call for a specific group
* @details      This service is non reentrant function on channel used for validating the calls
*               for functions that use a group
*
* @param[in]    u8ServiceId     The service id of the caller function
* @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           Valid call and group
* @retval     E_NOT_OK:       Invalid call or group
*
* @api
* @implements     Adc_ValidateCallAndGroup_Activity
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCallAndGroup
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidCallAndGroup = (Std_ReturnType)E_NOT_OK;

    if (NULL_PTR == Adc_pCfgPtr)
    {
        /* ADC300, ADC301, ADC302, ADC299, ADC298, ADC297, ADC296, ADC295, ADC294, ADC434 */
        Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_UNINIT);
    }
    else if (Group >= Adc_pCfgPtr->GroupCount)
    {
        /* ADC218, ADC225, ADC131, ADC130, ADC129, ADC128, ADC152, ADC126, ADC125, ADC423 */
        Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_PARAM_GROUP);
    }
    else
    {
        ValidCallAndGroup = (Std_ReturnType)E_OK;
    }

    return ValidCallAndGroup;
}
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

#if (ADC_GET_INJECTED_CONVERSION_STATUS_API == STD_ON) || \
    (ADC_CALIBRATION == STD_ON) || \
    (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) || \
    defined(__DOXYGEN__)
#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
/**
* @brief        This function validates the call for a specific unit
* @details      This service is non reentrant function on channel used for validating the calls
*               for functions that use a unit
*
* @param[in]    u8ServiceId     The service id of the caller function
* @param[in]    Unit          The unit id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           Valid call and group
* @retval     E_NOT_OK:       Invalid call or group
*
* @api
* @implements     Adc_ValidateCallAndUnit_Activity
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCallAndUnit
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidCallAndUnit = (Std_ReturnType)E_NOT_OK;
    VAR(boolean, AUTOMATIC) bFoundUnit = (boolean)FALSE;
    VAR(Adc_HwUnitType, AUTOMATIC) HwIndex = 0U;

    if (NULL_PTR == Adc_pCfgPtr)
    {
        Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_UNINIT);
    }
    else
    {
        for(HwIndex = 0U; HwIndex < Adc_pCfgPtr->Misc.Adc_MaxHwCfg; HwIndex++)
        {
            /* Get the index of hardware unit in structure which will match with the hardware unit ID*/
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if(Unit == Adc_pCfgPtr->pAdc[HwIndex].AdcHardwareUnitId)
            {
                bFoundUnit = (boolean)TRUE;
                break;
            }
        }
        if ((boolean)FALSE == bFoundUnit)
        {
            Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_PARAM_UNIT);
        }
        else
        {
            ValidCallAndUnit = (Std_ReturnType)E_OK;
        }
    }

    return ValidCallAndUnit;
}
#endif /* ADC_VALIDATE_CALL_AND_UNIT */
#endif /* (ADC_GET_INJECTED_CONVERSION_STATUS_API == STD_ON) || (ADC_CALIBRATION == STD_ON) */

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
#if (ADC_VALIDATE_NOTIFY_CAPABILITY == STD_ON)
/**
* @brief        This function checks the notification capability of a group.
* @details      This service is non reentrant function on channel used for validating the
*               notification capability of a group.
*
* @param[in]    u8ServiceId     The service id of the caller function
* @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           Valid notification capability
* @retval     E_NOT_OK:       Invalid notification capability
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_NotifyCapablity
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidCapability = (Std_ReturnType)E_OK;

    switch (u8ServiceId)
    {
        case ADC_ENABLEGROUPNOTIFICATION_ID:
        case ADC_DISABLEGROUPNOTIFICATION_ID:
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if (NULL_PTR == Adc_pCfgPtr->pGroups[Group].Notification)
            {
                ValidCapability = (Std_ReturnType)E_NOT_OK;
                /* ADC166, ADC165 */
                Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_NOTIF_CAPABILITY);
            }
            break;
        }
        default:
        {
            break;
        }
    }
    return ValidCapability;
}
#endif /* ADC_VALIDATE_NOTIFY_CAPABILITY == STD_ON */
#endif /* ADC_GRP_NOTIF_CAPABILITY == STD_ON */

/**
* @brief          Initializes the group status structures.
* @details        Initializes the group status structures with the default values.
*
* @param[in]      void
*
* @return         void
*
* @pre            Driver must be initialized.
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_InitGroupsStatus(void)
{
    VAR(Adc_GroupType,AUTOMATIC) Group = 0U;

    /* Initialize Group Status structures to beginning values */
    for (Group = 0U; Group < Adc_pCfgPtr->GroupCount; Group++)
    {
        /* ADC221, ADC307 */
        Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
        /* this group was not converted yet */
        Adc_aGroupStatus[Group].eAlreadyConverted = ADC_NOT_YET_CONVERTED;

        Adc_aGroupStatus[Group].ResultIndex = 0U;
#ifdef ADC_CURRENT_CHANNEL_USED
        Adc_aGroupStatus[Group].CurrentChannel = 0U;
#endif /* ADC_CURRENT_CHANNEL_USED */
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
        Adc_aGroupStatus[Group].bLimitCheckFailed = (boolean)FALSE;
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */

