xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
/* ADC077 */
#if (ADC_HW_TRIGGER_API == STD_ON)
        Adc_aGroupStatus[Group].eHwTriggering = ADC_HWTRIGGER_DISABLED;
    #if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
        Adc_aGroupStatus[Group].eCtuTriggering = ADC_HWTRIGGER_DISABLED;
    #endif  /* ADC_ENABLE_CTUTRIG_API == STD_ON */
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
        Adc_aGroupStatus[Group].eNotification = ADC_NOTIFICATION_DISABLED;
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */

#if (ADC_SETCHANNEL_API == STD_ON)
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_aRuntimeGroupChannel[Group].pChannel = Adc_pCfgPtr->pGroups[Group].pAssignment;
    #ifdef ADC_PDB_SUPPORTED
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_aRuntimeGroupChannel[Group].pu16Delays = Adc_pCfgPtr->pGroups[Group].pDelay;
        Adc_aRuntimeGroupChannel[Group].u32Mask = 0xFFFFFFFFUL;
    #endif /* ADC_PDB_SUPPORTED */
    #if (defined(ADC_PTUV3_SUPPORTED) && (ADC_HW_TRIGGER_API == STD_ON))
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_aRuntimeGroupChannel[Group].pu16Delays = Adc_pCfgPtr->pGroups[Group].pDelay;
    #endif /* (defined(ADC_PTUV3_SUPPORTED) && (ADC_HW_TRIGGER_API == STD_ON)) */
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_aRuntimeGroupChannel[Group].ChannelCount = Adc_pCfgPtr->pGroups[Group].AssignedChannelCount;
        Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated = (boolean)FALSE;
#endif
    }
}

/**
* @brief          Initializes the Unit status structures.
* @details        Initializes the Unit status structures with the default values.
*
* @param[in]      void
*
* @return         void
*
* @pre            Driver must be initialized.
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_InitUnitStatus(void)
{
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) QueueIdx = 0U;

    for(Unit = 0U; Unit < (Adc_HwUnitType)ADC_MAX_HW_UNITS; Unit++)
    {
        /* Filled slots in the queue */
        Adc_aUnitStatus[Unit].SwNormalQueueIndex = 0U;
        /* Mark all the queue slots as "empty" */
        for(QueueIdx = 0U; QueueIdx < ADC_QUEUE_MAX_DEPTH_MAX; QueueIdx++)
        {
            Adc_aUnitStatus[Unit].SwNormalQueue[QueueIdx] = 0U;
        }

        /* SW Injected queue initialization */
        Adc_aUnitStatus[Unit].SwInjectedQueue[0] =0U;
           /* Filled slots in the sw injected queue */
        Adc_aUnitStatus[Unit].SwInjectedQueueIndex = 0U;

#if (ADC_HW_TRIGGER_API == STD_ON)
        Adc_aUnitStatus[Unit].HwInjectedQueue[0] = 0U;
        /* Filled slots in the Hw queue */
        Adc_aUnitStatus[Unit].HwInjectedQueueIndex = 0U;

        Adc_aUnitStatus[Unit].HwNormalQueue[0] = 0U;
        /* Filled slots in the Hw queue */
        Adc_aUnitStatus[Unit].HwNormalQueueIndex = 0U;
    #if (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON)
        /* by default consider all groups regular groups */
        Adc_aUnitStatus[Unit].eHwQueueGroupType = ADC_REGULAR_GROUP_TYPE;
    #endif /* (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON) */
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
#ifdef ADC_PDB_SUPPORTED
        Adc_aUnitStatus[Unit].u8Sc1Used = 0U;
#endif /* ADC_PDB_SUPPORTED */
    }
#if (ADC_POWER_STATE_SUPPORTED == STD_ON) || defined(__DOXYGEN__)
    Adc_eCurrentState = ADC_FULL_POWER;
    Adc_eTargetState = ADC_NODEFINE_POWER;
#endif /* (ADC_POWER_STATE_SUPPORTED == STD_ON) */
}

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
/**
* @brief          Checks if conversion values are in the configured range.
* @details        Return true if conversion values are in the configured range, otherwise false.
*
* @param[in]      value       Adc conversion value.
*                 Unit        Adc Hardware Unit.
*                 Index       Adc channel index assigned to a group.
*
* @return         boolean     Conversion value in range flag.
* @retval         TRUE        if conversion values are in the configured range.
* @retval         FALSE       if conversion values are not in the configured range.
*
* @pre            Driver must be initialized.
* @violates @ref Adc_c_REF_3 internal linkage vs external linkage.
*/
FUNC(boolean, ADC_CODE) Adc_CheckConversionValuesInRange
(
    VAR(Adc_ValueGroupType, AUTOMATIC) Value,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_ChannelType, AUTOMATIC) Index
)
{
    VAR(boolean, AUTOMATIC) bValInRange = (boolean)FALSE;
    VAR(Adc_ChannelRangeSelectType, AUTOMATIC) eChRange;
    VAR(Adc_ValueGroupType, AUTOMATIC) LowLimit;
    VAR(Adc_ValueGroupType, AUTOMATIC) HighLimit;
    VAR(Adc_HwUnitType, AUTOMATIC) HwIndex;

    VAR(Adc_ChannelType, AUTOMATIC) Shift = 0U;
    VAR(uint16, AUTOMATIC) u16AdcMask = ADC_DATA_MASK_U16;

    HwIndex = Adc_pCfgPtr->Misc.aHwLogicalId[Unit];
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    eChRange = Adc_aChannelsLimitCheckingCfg[HwIndex][Index].eChannelRange;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    LowLimit = (Adc_ValueGroupType)Adc_aChannelsLimitCheckingCfg[HwIndex][Index].ChannelLowLimit;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    HighLimit = (Adc_ValueGroupType)Adc_aChannelsLimitCheckingCfg[HwIndex][Index].ChannelHighLimit;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    Shift = (16U - (Adc_pCfgPtr->pAdc[HwIndex].Res));

#if (ADC_RESULT_ALIGNMENT == ADC_ALIGN_LEFT)
    Value = (Value & u16AdcMask) >> Shift;
#else
    Value = Value & (u16AdcMask >> Shift);
#endif /* (ADC_RESULT_ALIGNMENT == ADC_ALIGN_LEFT) */
    switch (eChRange)
    {
        /* Complete range - independent from channel limit settings. */
        case ADC_RANGE_ALWAYS:
        {
            bValInRange = (boolean)TRUE;
            break;
        }
        /* Range between low limit and high limit - high limit value included. */
        case ADC_RANGE_BETWEEN:
        {
            if ((Value > LowLimit) && (Value <= HighLimit))
            {
                bValInRange = (boolean)TRUE;
            }
            break;
        }
        /* Range above high limit or below low limit - low limit value included. */
        case ADC_RANGE_NOT_BETWEEN:
        {
            if ((Value > HighLimit) || (Value <= LowLimit))
            {
                bValInRange = (boolean)TRUE;
            }
            break;
        }
        /* Range below high limit -high limit value included. */
        case ADC_RANGE_NOT_OVER_HIGH:
        {
            if (Value <= HighLimit)
            {
                bValInRange = (boolean)TRUE;
            }
            break;
        }
        /* Range above low limit. */
        case ADC_RANGE_NOT_UNDER_LOW:
        {
            if (Value > LowLimit)
            {
                bValInRange = (boolean)TRUE;
            }
            break;
        }
        /* Range above high limit. */
        case ADC_RANGE_OVER_HIGH:
        {
            if (Value > HighLimit)
            {
                bValInRange = (boolean)TRUE;
            }
            break;
        }
        /* Range below low limit - low limit value included. */
        case ADC_RANGE_UNDER_LOW:
        {
            if (Value <= LowLimit)
            {
                bValInRange = (boolean)TRUE;
            }
            break;
        }
        /* Unexpected value */
        default:
        {
            break;
        }
    }
    return (boolean)bValInRange;
}
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */

#if (ADC_ENABLE_QUEUING == STD_ON)
/**
* @brief          This function performs the dequeue operation on the internal ADC queue.
* @details        This function performs the dequeue operation on the internal ADC queue.
*
* @param[in]      Unit            The used hw Unit.
* @param[in]      CurQueueIndex   The current queue index.
*
* @return         void
*
* @pre This function must be called from a critical region. It is not protecting itself against interruptions.
* @violates @ref Adc_c_REF_3 internal linkage vs external linkage.
*/
FUNC(void, ADC_CODE) Adc_RemoveFromQueue
(
    CONST(Adc_HwUnitType, AUTOMATIC) Unit,
    CONST(Adc_QueueIndexType, AUTOMATIC) CurQueueIndex
)
{
    VAR(Adc_QueueIndexType, AUTOMATIC) PositionIndex = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) CurrentIndex = Adc_aUnitStatus[Unit].SwNormalQueueIndex;

    if((Adc_QueueIndexType)1U >= CurrentIndex)
    {
        /* Zero or one element present in the queue */
        Adc_aUnitStatus[Unit].SwNormalQueueIndex = 0U;
    }
    else
    {
        /* More than one element in the queue */
        /* Move all elements after the one to remove (from CurQueueIndex position) one place to the left */
        for(PositionIndex = (CurQueueIndex + 1U); PositionIndex < CurrentIndex; PositionIndex++)
        {
            Adc_aUnitStatus[Unit].SwNormalQueue[PositionIndex - 1U] =
            (Adc_GroupType)Adc_aUnitStatus[Unit].SwNormalQueue[PositionIndex];
        }
        
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_18();
        Adc_aUnitStatus[Unit].SwNormalQueueIndex--;
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_18();
    }
}
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) && (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE))
/**
* @brief          This function inserts a group into the queue.
* @details        This function inserts a group into the queue.
*
* @param[in]      Unit      The hardware Unit.
* @param[in]      Group     The group id.
*
* @return         void
*
*/
/* ADC310, ADC311, ADC332, ADC417 */
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_InsertIntoQueue
(
    CONST(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
#if (ADC_QUEUE_MAX_DEPTH_MAX != 1U)
    /* Temporary index in the Queue */
    VAR(Adc_QueueIndexType, AUTOMATIC) QueueTemp = 0U;
#endif
    /* Position of the new Group in the Queue */
    VAR(Adc_QueueIndexType, AUTOMATIC) Pos = 0U;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    VAR(Adc_GroupPriorityType, AUTOMATIC) gPri = Adc_pCfgPtr->pGroups[(Group)].Priority;
    VAR(Adc_QueueIndexType, AUTOMATIC) qPtr = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    VAR(Std_ReturnType, AUTOMATIC) DemTest = (Std_ReturnType)E_OK;

