xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
    /* Find the right place in Queue (ADC332, ADC417) */
    /**
     * @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic
     */
    while(Adc_pCfgPtr->pGroups[(Adc_aUnitStatus[Unit].SwNormalQueue[Pos])].Priority >= gPri)
    {
        Pos++;
        if (Pos >= qPtr)
        {
            break;
        }
    }
    if(0U == Pos)
    {
        /* Highest priority group detected */
        DemTest = Adc_Ipw_StopCurrentConversion(Unit, Adc_aUnitStatus[Unit].SwNormalQueue[0]);
    }
    #if (ADC_QUEUE_MAX_DEPTH_MAX != 1U)
    /* Make space for the new Group */
    if(qPtr > Pos)
    {
        for(QueueTemp = qPtr; QueueTemp > Pos; QueueTemp--)
        {
            /* Move elements to the right */
            Adc_aUnitStatus[Unit].SwNormalQueue[QueueTemp] = (Adc_GroupType)Adc_aUnitStatus[Unit].SwNormalQueue[QueueTemp- 1U];
        }
    }
    #endif
    /* Place the Group in the Queue */
    Adc_aUnitStatus[Unit].SwNormalQueue[Pos] = Group;
    /* Increase the Queue Index */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_19();
    Adc_aUnitStatus[Unit].SwNormalQueueIndex++;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_19();

    return DemTest;
}
#endif  /* (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE) */

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
/**
* @brief          This function update queue before start a group conversion.
* @details        This function update queue before start a group conversion.
*
* @param[in]      Group     The group id.
* @param[in]      Unit      The hardware Unit.
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusStartConversion
(
    CONST(Adc_GroupType, AUTOMATIC) Group,
    CONST(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    /* ADC335 */
#if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
    /* First available slot in the Queue */
    VAR(Adc_QueueIndexType, AUTOMATIC) qPtr = 0U;
#else
#if (ADC_ENABLE_QUEUING == STD_ON) && (ADC_QUEUE_MAX_DEPTH_MAX != 1U)
    VAR(Adc_QueueIndexType, AUTOMATIC) qPtr = 0U;
#endif
#endif
#if (ADC_ENABLE_QUEUING == STD_ON)
    VAR(Adc_QueueIndexType, AUTOMATIC) SwNormalQueueIndex;
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */
    VAR(Std_ReturnType, AUTOMATIC) DemTest = (Std_ReturnType)E_OK;
    
    /* Mark the Group as BUSY when the Group goes to the Queue or gets started */
    /* ADC222 */
    Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
    /* ADC431 */
    Adc_aGroupStatus[Group].ResultIndex = 0U;

#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
    /* Injected conversion mode */
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if ((Adc_GroupConvType)ADC_CONV_TYPE_INJECTED == Adc_pCfgPtr->pGroups[Group].eType)
    {
#ifdef ADC_DMA_SUPPORTED
        if (ADC_DMA == Adc_pCfgPtr->Misc.u8Adc_DmaInterruptSoftware[Unit])
        {
            if (Adc_aUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0U)
            {
                /* Queue is NOT Empty */
                DemTest = Adc_Ipw_StopCurrentConversion(Unit, Adc_aUnitStatus[Unit].SwNormalQueue[0]);
            }
        }
#endif
        /* Place the Group in the SW Inj Queue */
        Adc_aUnitStatus[Unit].SwInjectedQueue[0] = Group;
        
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_20();
        /* Increase the Queue Index */
        Adc_aUnitStatus[Unit].SwInjectedQueueIndex++;
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_20();

        Adc_Ipw_StartInjectedConversion(Unit);

#if ((ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) && defined(ADC_DMA_SUPPORTED))
        /* Dem error was checked and not failed, so it must be reported passed */
        if (((Std_ReturnType)E_OK == DemTest) && ((uint32)STD_ON == Adc_E_TimeoutCfg.state))
        {
            /* Report production error passed.  */
            (void) Dem_SetEventStatus((Dem_EventIdType)Adc_E_TimeoutCfg.id, DEM_EVENT_STATUS_PASSED);
        }
#endif /* (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) */
        /** @violates @ref Adc_c_REF_8 Return statement before end of function. */
        return;
    }
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */

    /* Normal conversion*/
#if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    qPtr = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    if (qPtr > (Adc_QueueIndexType)0U)
    {
        /* Queue is NOT Empty */
        DemTest = Adc_InsertIntoQueue(Unit, Group);
    }
#else /* ADC_PRIORITY_IMPLEMENTATION == ADC_PRIORITY_NONE */
 #if (ADC_ENABLE_QUEUING == STD_ON) && (ADC_QUEUE_MAX_DEPTH_MAX != 1U)
     /* ADC333 */
    qPtr = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    if (qPtr > (Adc_QueueIndexType)0U)
    {
        /* Place the Group in the Queue */
        Adc_aUnitStatus[Unit].SwNormalQueue[qPtr] = Group;
        
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_21();
        /* Increase the Queue Index */
        Adc_aUnitStatus[Unit].SwNormalQueueIndex++;
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_21();
    }
 #else /* ADC_ENABLE_QUEUING == STD_OFF*/
  /* In this case all the StartConversion should be rejected by DET */
 #endif /* (ADC_ENABLE_QUEUING == STD_ON) */
#endif /* ADC_PRIORITY_IMPLEMENTATION == ADC_PRIORITY_NONE */

#if (ADC_ENABLE_QUEUING == STD_ON)
    SwNormalQueueIndex = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    /* ADC338, ADC417 */
    if((Group == Adc_aUnitStatus[Unit].SwNormalQueue[0]) || (0U == SwNormalQueueIndex))
    {
        /* No_priorities OR Queue_is_empty */
        /* Indicate a new group was added to the queue */
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */
        if (0U == Adc_aUnitStatus[Unit].SwNormalQueueIndex)
        {
            /* Place the Group in the Queue */
            Adc_aUnitStatus[Unit].SwNormalQueue[0] = Group;
            
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_22();
            Adc_aUnitStatus[Unit].SwNormalQueueIndex++;
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_22();
        }

        /* ADC will not be running - no ISR can occur now */
        Adc_Ipw_StartNormalConversion(Unit);

#if (ADC_ENABLE_QUEUING == STD_ON)
    }
    else
    {
        /* Nothing for misra */
    }
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */
#if ((ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) && (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE))
    /* Dem error was checked and not failed, so it must be reported passed */
    if (((Std_ReturnType)E_OK == DemTest) && ((uint32)STD_ON == Adc_E_TimeoutCfg.state))
    {
        /* Report production error passed.  */
        (void) Dem_SetEventStatus((Dem_EventIdType)Adc_E_TimeoutCfg.id, DEM_EVENT_STATUS_PASSED);
    }
#endif /* (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) */
    (void)DemTest;
}

/**
* @brief          This function update queue before start a group conversion.
* @details        This function update queue before start a group conversion.
*
* @param[in]      Group     The group id.
* @param[in]      Unit      The hardware Unit.
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusStopConversion
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    /* ADC437 */
#if (ADC_ENABLE_QUEUING == STD_ON)
    VAR(Adc_QueueIndexType, AUTOMATIC) SwNormalQueueIndex = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) RemovedPos = 0U;
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */
    VAR(Std_ReturnType, AUTOMATIC) DemTest = (Std_ReturnType)E_OK;
    VAR(Adc_GroupConvModeType, AUTOMATIC) eMode;
    VAR(Adc_GroupAccessModeType, AUTOMATIC) eAccessMode;
    VAR(Adc_StreamBufferModeType, AUTOMATIC) eBufferMode;
    VAR(Adc_StatusType, AUTOMATIC) eConversion;
    
