xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    Adc_aGroupStatus[Group].bLimitCheckFailed = (boolean)FALSE;
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */

    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic shall be the only allowed form of pointer arithmetic */
    eMode = Adc_pCfgPtr->pGroups[Group].eMode;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic shall be the only allowed form of pointer arithmetic */
    eAccessMode = Adc_pCfgPtr->pGroups[Group].eAccessMode;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic shall be the only allowed form of pointer arithmetic */
    eBufferMode = Adc_pCfgPtr->pGroups[Group].eBufferMode;
    
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_28();
    eConversion = Adc_aGroupStatus[Group].eConversion;

     /* FD reset number of samples completed */
     Adc_aGroupStatus[Group].ResultIndex = 0U;
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
     /* disable group notification (ADC155) */
     Adc_aGroupStatus[Group].eNotification = ADC_NOTIFICATION_DISABLED;
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
#if (ADC_SETCHANNEL_API == STD_ON) && defined(ADC_PDB_SUPPORTED)
     Adc_aRuntimeGroupChannel[Group].u32Mask = 0xFFFFFFFFUL;
#endif
    /**
     * @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic
     */
    if(((ADC_CONV_MODE_ONESHOT == eMode) || \
        ((ADC_ACCESS_MODE_STREAMING == eAccessMode) && (ADC_STREAM_BUFFER_LINEAR == eBufferMode)) \
       ) && (ADC_STREAM_COMPLETED == eConversion) \
      )
    {
        /* ADC221, ADC360 */
        /* group is stopped, change its status to IDLE  */
        Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_28();
    }
    else
    {
    #if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        if ((Adc_GroupConvType)ADC_CONV_TYPE_INJECTED == Adc_pCfgPtr->pGroups[Group].eType)
        {
            if (Group == Adc_aUnitStatus[Unit].SwInjectedQueue[0])
            {
                /* ADC386, ADC385 */
                DemTest = Adc_Ipw_StopCurrentConversion(Unit, Group);
                /* zero elements in the sw injected queue */
                Adc_aUnitStatus[Unit].SwInjectedQueueIndex = 0U;
            }
        }
        else
    #endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */
        {
    #if (ADC_ENABLE_QUEUING == STD_ON)
            /* ADC437 */
            /* Find the Group in the Queue */
            RemovedPos = Adc_aUnitStatus[Unit].SwNormalQueueIndex;  /* initialize with something invalid */

            for (SwNormalQueueIndex = 0U; SwNormalQueueIndex < Adc_aUnitStatus[Unit].SwNormalQueueIndex; SwNormalQueueIndex++)
            {
                if (Group == Adc_aUnitStatus[Unit].SwNormalQueue[SwNormalQueueIndex] )
                {
                    /* The group is found in the Queue */
                    /* Store the position of the group to be removed */
                    RemovedPos = SwNormalQueueIndex;

                    /* Stop the conversion of all channels belonging to this group */
                    if((Adc_QueueIndexType)0U == SwNormalQueueIndex) /* In this case the group might be under conversion */
    #endif /* (ADC_ENABLE_QUEUING == STD_ON) */
                    {
                        /* ADC386 */
                        DemTest = Adc_Ipw_StopCurrentConversion(Unit, Group);
                    }
    #if (ADC_ENABLE_QUEUING == STD_ON)
                    /* ADC438 */
                    /* Remove group from Queue */
                    Adc_RemoveFromQueue(Unit, SwNormalQueueIndex);
                }
            }
    #else
            /* No element will be present in the queue */
            Adc_aUnitStatus[Unit].SwNormalQueueIndex = 0U;
    #endif /* (ADC_ENABLE_QUEUING == STD_ON) */
        }

        /* ADC221, ADC360 */
        /* group is stopped, change its status to IDLE  */
        Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_28();

    #if (ADC_ENABLE_QUEUING == STD_ON)
        /* Start the next group in the Queue (if any) */
        if((Adc_QueueIndexType)0U == RemovedPos)
        {
            if(Adc_aUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0U)
            {
                /* Structures and pointers will be initialized when the next Group starts */
                Adc_Ipw_StartNormalConversion(Unit);
            }
        }
    #endif /* (ADC_ENABLE_QUEUING == STD_ON) */

    #if (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF)
            /* Dem error was checked and not failed, so it must be reported passed */
            if (((Std_ReturnType)E_OK == DemTest) && ((uint32)STD_ON == Adc_E_TimeoutCfg.state))
            {
                /* Report production error passed.  */
                (void) Dem_SetEventStatus((Dem_EventIdType)Adc_E_TimeoutCfg.id, DEM_EVENT_STATUS_PASSED);
            }
    #else
        (void)DemTest;
    #endif /* (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) */
    }
}
#endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */

#if (ADC_READ_GROUP_API == STD_ON)
/**
* @brief          This function updates the status variables after the read group operation.
* @details        This function updates the status variables after the read group operation.
*
* @param[in]      Group       The group of which conversion will be started.
* @param[in]      bFlag        Indicates if the values are in the configured limit range.
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusReadGroupNoInt
(
    CONST(Adc_GroupType, AUTOMATIC) Group,
    CONST(boolean, AUTOMATIC) bFlag
)
{
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
#if (ADC_ENABLE_QUEUING == STD_ON)
    VAR(Adc_QueueIndexType, AUTOMATIC) SwNormalQueueIndex = 0U;
#endif

    /* at least once the group was converted */
    Adc_aGroupStatus[Group].eAlreadyConverted = ADC_ALREADY_CONVERTED;
    /* Update conversion status*/
    /* Conversion values are not in the configured range */
    if ((boolean)TRUE == bFlag)
    {
    #if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
        Adc_aGroupStatus[Group].bLimitCheckFailed = (boolean)FALSE;
    #endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
        /* NOTE: Streaming groups are NOT allowed without interrupts in configuration */
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        if(ADC_CONV_MODE_CONTINUOUS == Adc_pCfgPtr->pGroups[Group].eMode)
        {
            Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
        }
        /* Case of software - one shot mode */
        else
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if(ADC_TRIGG_SRC_SW == Adc_pCfgPtr->pGroups[Group].eTriggerSource)
            {
                /* ADC221 */
                Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
        #if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
                /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
                if ((Adc_GroupConvType)ADC_CONV_TYPE_INJECTED == Adc_pCfgPtr->pGroups[Group].eType)
                {
                    if (Adc_aUnitStatus[Unit].SwInjectedQueueIndex > (Adc_QueueIndexType)0)
                    {
                        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_23();
                        /* empty queue of  SW injected conversions */
                        Adc_aUnitStatus[Unit].SwInjectedQueueIndex--;
                        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_23();
                    }
                }
                else /* SW NORMAL CONVERSION */
        #endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */
                {
                    if (Adc_aUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0)
                    {
        #if (ADC_ENABLE_QUEUING == STD_ON)
                        /* remove group without interrupts from queue  */
                        for (SwNormalQueueIndex = 0U; SwNormalQueueIndex < Adc_aUnitStatus[Unit].SwNormalQueueIndex; SwNormalQueueIndex++)
                        {
                            if (Group == Adc_aUnitStatus[Unit].SwNormalQueue[SwNormalQueueIndex])
                            {
                                /* The group is found in the Queue */
                                Adc_RemoveFromQueue(Unit, SwNormalQueueIndex);
                                break;
                            }
                        }
        #if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
                        /* Start / restore next conversion in the queue*/
                        if (0U == SwNormalQueueIndex)
                        {
                            if(Adc_aUnitStatus[Unit].SwNormalQueueIndex > 0U)
                            {
                                Adc_Ipw_StartNormalConversion(Unit);
                            }
                        }
        #endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */
        #else
                        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_24();
                        Adc_aUnitStatus[Unit].SwNormalQueueIndex--;
                        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_24();
        #endif
                    }
                }
            }
        }
    }
    #if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    else
    {
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        if(ADC_CONV_MODE_ONESHOT == Adc_pCfgPtr->pGroups[Group].eMode)
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if(ADC_TRIGG_SRC_SW == Adc_pCfgPtr->pGroups[Group].eTriggerSource)
            {
                /* ADC449 */
                Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
            }
            else
            {
                /* ADC450 */
                Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
            }
        }
        Adc_aGroupStatus[Group].bLimitCheckFailed = (boolean)TRUE;
    }
    #endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
}

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusReadGroupInt
(
    CONST(Adc_GroupType, AUTOMATIC) Group
)
{
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_29();
    /* The following code has been added to respect the State Diagram of Streaming Access Mode */
    if (ADC_COMPLETED == Adc_aGroupStatus[Group].eConversion)
    {
        Adc_aGroupStatus[Group].ResultIndex = 0U;
        /* ADC331 -- ADC222*/
        Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
    }
    else if (ADC_STREAM_COMPLETED == Adc_aGroupStatus[Group].eConversion)
    {
        /* Compliance with State Diagram */
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        if (ADC_TRIGG_SRC_SW == Adc_pCfgPtr->pGroups[Group].eTriggerSource)
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if((ADC_CONV_MODE_ONESHOT == Adc_pCfgPtr->pGroups[Group].eMode)|| \
               ((ADC_CONV_MODE_CONTINUOUS == Adc_pCfgPtr->pGroups[Group].eMode) && \
                (ADC_ACCESS_MODE_STREAMING == Adc_pCfgPtr->pGroups[Group].eAccessMode) && \
                (ADC_STREAM_BUFFER_LINEAR == Adc_pCfgPtr->pGroups[Group].eBufferMode)
               )
              )
            {
                /* ADC330 - ADC221 */
                Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
            }
            else
            { /* Continuous*/
                /* ADC329 -- ADC222 */
                Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
            }
        }
#if (ADC_HW_TRIGGER_API == STD_ON)
        else
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if((ADC_ACCESS_MODE_STREAMING == Adc_pCfgPtr->pGroups[Group].eAccessMode)&& \
               (ADC_STREAM_BUFFER_LINEAR == Adc_pCfgPtr->pGroups[Group].eBufferMode)
              )
            {
                /* ADC330 - ADC221*/
                Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
            }
            else
            { /* Simple One-shot mode, in other words in single access mode*/
                /* ADC329 -- ADC222*/
                Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
            }
        }
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
    }
    else
    {
        /* Nothing for misra */
    }
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_29();
}

