xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
#endif /* (ADC_READ_GROUP_API == STD_ON) */

#if (ADC_HW_TRIGGER_API == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusEnableHardware
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{

#if (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON)
    /* if the queue is empty than simply copy into the groups in queue type the first group type */
    if ((Adc_QueueIndexType)0 == Adc_aUnitStatus[Unit].HwInjectedQueueIndex)
    {
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_aUnitStatus[Unit].eHwQueueGroupType = Adc_pCfgPtr->pGroups[Group].IsMHTGroup;
    }
#endif /* (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON) */

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_25();
#if (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if((Adc_GroupConvType)ADC_CONV_TYPE_NORMAL == Adc_pCfgPtr->pGroups[Group].eType)
    {
        Adc_aUnitStatus[Unit].HwNormalQueue[Adc_aUnitStatus[Unit].HwNormalQueueIndex] = Group;
        Adc_aUnitStatus[Unit].HwNormalQueueIndex++;
    }
    else
#endif /* (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON) */
    {
        Adc_aUnitStatus[Unit].HwInjectedQueue[Adc_aUnitStatus[Unit].HwInjectedQueueIndex] = Group;
        Adc_aUnitStatus[Unit].HwInjectedQueueIndex++;
    }
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_25();

    /* Mark the Group as BUSY when the Group goes to the Queue or gets started */
    /* ADC222 */
    Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
    /* if HW trigger is enabled for a group, its HW trigger status becomes ENABLED */
    Adc_aGroupStatus[Group].eHwTriggering = ADC_HWTRIGGER_ENABLED;
    /* ADC432 */
    /* Put the conversion results from Results Buffer Base Address */
    Adc_aGroupStatus[Group].ResultIndex = 0U;
}

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusDisableHardware
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    /* [ADC157] if HW trigger is disabled for a group, its HW trigger status becomes DISABLED */
    Adc_aGroupStatus[Group].eNotification = ADC_NOTIFICATION_DISABLED;
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */

    /* ADC361, ADC221 */
    /* Mark the Group status as IDLE */
    Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
    /* Hardware trigger is disabled */
    Adc_aGroupStatus[Group].eHwTriggering = ADC_HWTRIGGER_DISABLED;
#if (ADC_SETCHANNEL_API == STD_ON) && defined(ADC_PDB_SUPPORTED)
    Adc_aRuntimeGroupChannel[Group].u32Mask = 0xFFFFFFFFUL;
#endif

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_26();
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if((Adc_GroupConvType)ADC_CONV_TYPE_INJECTED == Adc_pCfgPtr->pGroups[Group].eType)
    {
        if(Adc_aUnitStatus[Unit].HwInjectedQueueIndex > 0U)
        {
            /* ADC429 */
            Adc_aUnitStatus[Unit].HwInjectedQueueIndex--;
        }
    }
#if (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)
    else
    {
        if(Adc_aUnitStatus[Unit].HwNormalQueueIndex > 0U)
        {
            /* ADC429 */
            Adc_aUnitStatus[Unit].HwNormalQueueIndex--;
        }
    }
#endif /* (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON) */

    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_26();
}
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

/**
* @brief          This function updates the status variables after the getstreamlastpointer operation.
* @details        This function updates the status variables after the getstreamlastpointer operation.
*
* @param[in]      Group       The group of which conversion will be started.
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusAfterGetStream
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_30();
    /* The following code has been added to respect the State Diagram of Streaming Access Mode */
    if (ADC_COMPLETED == Adc_aGroupStatus[Group].eConversion)
    {
        Adc_aGroupStatus[Group].ResultIndex = 0U;
        /* ADC328 -- ADC222*/
        Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
    }

    if (ADC_STREAM_COMPLETED == Adc_aGroupStatus[Group].eConversion)
    {
        /* Compliance with State Diagram */
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        if (ADC_TRIGG_SRC_SW == Adc_pCfgPtr->pGroups[Group].eTriggerSource)
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if((ADC_CONV_MODE_ONESHOT == Adc_pCfgPtr->pGroups[Group].eMode) || \
               ((ADC_CONV_MODE_CONTINUOUS == Adc_pCfgPtr->pGroups[Group].eMode) && \
                (ADC_ACCESS_MODE_STREAMING == Adc_pCfgPtr->pGroups[Group].eAccessMode) && \
                (ADC_STREAM_BUFFER_LINEAR == Adc_pCfgPtr->pGroups[Group].eBufferMode)
               )
              )
            {
                /* ADC327 -- ADC221*/
                Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
            }
            else
            { /* Continuous*/
                /* ADC326 -- ADC222*/
                Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
            }
        }
#if (STD_ON == ADC_HW_TRIGGER_API)
        else
        {
            /* Hw Trigger*/
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if((ADC_ACCESS_MODE_STREAMING == Adc_pCfgPtr->pGroups[Group].eAccessMode) && \
               (ADC_STREAM_BUFFER_LINEAR == Adc_pCfgPtr->pGroups[Group].eBufferMode)
              )
            {
                /* ADC327 -- ADC221 */
                Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
            }
            else /* One-shot mode or circular streaming*/
            {
                /* ADC326 -- ADC222 */
                Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
            }
        }
#endif /* (STD_ON == ADC_HW_TRIGGER_API ) */
    }
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_30();
}

#if ((ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) && (ADC_DEV_ERROR_DETECT == STD_ON))
/**
* @brief        This function validates the Adc unit is activated for Ctu control mode.
* @details      This service is a non reentrant function used for validating the Adc unit when
*               Ctu control mode is used.
*
* @param[in]    Unit            The unit id
*
* @return       Std_ReturnType  Standard return type.
* @retval       E_OK:           The call is valid
* @retval       E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateUnitActive
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    VAR(Std_ReturnType, AUTOMATIC) Return = (Std_ReturnType)E_OK;

    if ((uint8)STD_OFF == Adc_pCfgPtr->pCtuCfgPtr->au8AdcUnitActive[Unit])
    {
        Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_PARAM_UNIT);
        Return = (Std_ReturnType)E_NOT_OK;
    }

