xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
    return Return;
}

/**
* @brief        This function validates the state of s unit when the Ctu Control is enabled.
* @details      This service is a non reentrant function used for validating the state of a unit
*               when the ctu control is enabled.
*
* @param[in]    Unit            The unit id
*
* @return       Std_ReturnType  Standard return type.
* @retval       E_OK:           The call is valid
* @retval       E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateCtuControlMode
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_OK;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwNormalQueue = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwInjectedQueue = 0U;
#if (ADC_HW_TRIGGER_API == STD_ON)
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInHwNormalQueue = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInHwInjectedQueue = 0U;
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

    switch(u8ServiceId)
    {
        case ADC_ENABLECTUCONTROLMODE_ID:
        {
            /* Get HW and SW queue sizes */
            NoGroupsInSwNormalQueue = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
            NoGroupsInSwInjectedQueue = Adc_aUnitStatus[Unit].SwInjectedQueueIndex;
#if (ADC_HW_TRIGGER_API == STD_ON)
            NoGroupsInHwNormalQueue = Adc_aUnitStatus[Unit].HwNormalQueueIndex;
            NoGroupsInHwInjectedQueue = Adc_aUnitStatus[Unit].HwInjectedQueueIndex;
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

            /* Check for ongoing conversions */
            if ((NoGroupsInSwNormalQueue != (Adc_QueueIndexType)0) ||
                (NoGroupsInSwInjectedQueue != (Adc_QueueIndexType)0) ||
#if (ADC_HW_TRIGGER_API == STD_ON)
                (NoGroupsInHwInjectedQueue != (Adc_QueueIndexType)0) ||
                (NoGroupsInHwNormalQueue != (Adc_QueueIndexType)0) ||
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
                ((boolean)TRUE == Adc_aUnitStatus[Unit].bCtuControlOngoing)
               )
            {
                ValidState = (Std_ReturnType)E_NOT_OK;
                Adc_ReportDetRuntimeError((uint8)ADC_ENABLECTUCONTROLMODE_ID, (uint8)ADC_E_BUSY);
            }
            break;
        }
        case ADC_DISABLECTUCONTROLMODE_ID:
        {
            /* Ctu control mode is not already enabled for this unit */
            if((boolean)FALSE == Adc_aUnitStatus[Unit].bCtuControlOngoing)
            {
                ValidState = (Std_ReturnType)E_NOT_OK;
                Adc_ReportDetError((uint8)ADC_DISABLECTUCONTROLMODE_ID, (uint8)ADC_E_IDLE);
            }
            break;
        }
        default:
        {
            break;
        }
    }
    return ValidState;
}
#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) && (ADC_DEV_ERROR_DETECT == STD_ON) */

#if (ADC_POWER_STATE_SUPPORTED == STD_ON) || defined(__DOXYGEN__)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateAndPtr
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) pResult
)
{
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_OK;

    if (NULL_PTR == pResult)
    {
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_PARAM_POINTER);
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
        RetVal = (Std_ReturnType)E_NOT_OK;
    }
    else if(NULL_PTR == Adc_pCfgPtr)
    {
        /* Adc module is not initialized */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        /* ADC496, ADC493, ADC491, ADC486 */
        Adc_ReportDetError(u8ServiceId, ADC_E_UNINIT);
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

        *pResult = ADC_NOT_INIT;
        RetVal = (Std_ReturnType)E_NOT_OK;
    }
    else
    {
        /* Nothing for misra */
    }
    return RetVal;
}

LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateIdleState
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) pResult
)
{
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_OK;
    VAR(Adc_HwUnitType, AUTOMATIC) Unit;
    VAR(Adc_QueueIndexType, AUTOMATIC) SwNormalQueueIdx;
    VAR(Adc_QueueIndexType, AUTOMATIC) SwInjQueueIdx;
#if (ADC_HW_TRIGGER_API == STD_ON)
    VAR(Adc_QueueIndexType, AUTOMATIC) HwNormalQueueIdx;
    VAR(Adc_QueueIndexType, AUTOMATIC) HwInjQueueIdx;
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
    VAR(Adc_HwUnitType, AUTOMATIC) HwIndex = 0U;

    for(HwIndex = 0U; HwIndex < Adc_pCfgPtr->Misc.Adc_MaxHwCfg; HwIndex++)
    {
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Unit = Adc_pCfgPtr->pAdc[HwIndex].AdcHardwareUnitId;
        SwNormalQueueIdx = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
        SwInjQueueIdx = Adc_aUnitStatus[Unit].SwInjectedQueueIndex;
#if (ADC_HW_TRIGGER_API == STD_ON)
        HwNormalQueueIdx = Adc_aUnitStatus[Unit].HwNormalQueueIndex;
        HwInjQueueIdx = Adc_aUnitStatus[Unit].HwInjectedQueueIndex;
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

        if((SwNormalQueueIdx > 0U) || (SwInjQueueIdx > 0U)
#if (ADC_HW_TRIGGER_API == STD_ON)
           ||(HwNormalQueueIdx > 0U) || (HwInjQueueIdx > 0U)
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
           ||((boolean)TRUE == Adc_aUnitStatus[Unit].bCtuControlOngoing)
#endif /* if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */
          )
        {
            /* Adc conversion is ongoing */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
/* ADC487 */
            Adc_ReportDetRuntimeError(u8ServiceId, ADC_E_NOT_DISENGAGED);
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
            *pResult = ADC_SEQUENCE_ERROR;
            RetVal = (Std_ReturnType)E_NOT_OK;
            break;
        }
    }/* end for(HwIndex = 0U; HwIndex <... */
    return RetVal;
}

LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidatePowerStateSupport
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_PowerStateType, AUTOMATIC) ePowerState,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) pResult
)
{
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_OK;

    /* If the power state is not supported or low power state is not supported at all */
    if(ePowerState >= ADC_NODEFINE_POWER)
    {
        /* The state is not supported */
        #if (ADC_DEV_ERROR_DETECT == STD_ON)
        Adc_ReportDetError(u8ServiceId, ADC_E_POWER_STATE_NOT_SUPPORTED);
        #endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

        *pResult = ADC_POWER_STATE_NOT_SUPP;
        RetVal = (Std_ReturnType)E_NOT_OK;
    }
    return RetVal;
}

