xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidatePowerStatePrepare
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) pResult
)
{
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_OK;

    /* If the terget state is invalid state */
    if(Adc_eTargetState >= ADC_NODEFINE_POWER)
    {
        /* The target power state is not prepared */
        #if (ADC_DEV_ERROR_DETECT == STD_ON)
        /* ADC490 */
        Adc_ReportDetError(u8ServiceId, ADC_E_PERIPHERAL_NOT_PREPARED);
        #endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

        *pResult = ADC_SEQUENCE_ERROR;
        RetVal = (Std_ReturnType)E_NOT_OK;
    }
    return RetVal;
}
#endif /* (ADC_POWER_STATE_SUPPORTED == STD_ON) */
/*==================================================================================================
                                       GLOBAL FUNCTIONS
==================================================================================================*/

/**
* @brief          Initializes the ADC hardware unit and the driver.
* @details        This function will initialize both the ADC HW unit and the driver structures.
*
* @param[in]      pConfigPtr   Pointer to configuration set in Variant PB
*                             (Variant PC requires a NULL_PTR).
* @return         void
*
* @api
*
* @post           Initializes the driver.
*
*
* @note           The function Autosar Service ID[hex]: 0x00.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements  Adc_Init_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_Init
(
    P2CONST(Adc_ConfigType, AUTOMATIC, ADC_APPL_CONST) ConfigPtr
)
{
    /* ADC365, ADC246, ADC056 */
#if ((ADC_VALIDATE_GLOBAL_CALL == STD_ON) || (ADC_VALIDATE_PARAMS == STD_ON))
    VAR(Std_ReturnType, AUTOMATIC) ValidStatus = (Std_ReturnType)E_NOT_OK;
#endif

#if (ADC_VALIDATE_GLOBAL_CALL == STD_ON)
    ValidStatus = Adc_ValidateGloballCall(ADC_INIT_ID);
    if ((Std_ReturnType)E_OK == ValidStatus)
    {
#endif /* ADC_VALIDATE_GLOBAL_CALL == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
        ValidStatus = Adc_ValidatePtrInit(ConfigPtr);
        if ((Std_ReturnType)E_OK == ValidStatus)
        {
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

#ifdef ADC_PRECOMPILE_SUPPORT
            /* ADC342 */
            Adc_pCfgPtr = &Adc_PBCfgVariantPredefined;
            (void)ConfigPtr;
#else
            /* ADC054 */
            Adc_pCfgPtr = ConfigPtr;
#endif /* ADC_PRECOMPILE_SUPPORT */

            /* Initialize the unit status for all units */
            Adc_InitUnitStatus();
            /* Initialize the group status for all groups */
            Adc_InitGroupsStatus();
            /* Call the low level function to initialize driver */
            Adc_Ipw_Init(Adc_pCfgPtr);

#if (ADC_VALIDATE_PARAMS == STD_ON)
        }
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

#if (ADC_VALIDATE_GLOBAL_CALL == STD_ON)
    }
    Adc_EndValidateGloballCall(ValidStatus, ADC_INIT_ID);
#endif /* ADC_VALIDATE_GLOBAL_CALL == STD_ON */
}

/**
* @brief          Initializes the group specific ADC result buffer pointer as
*                 configured to point to the pDataBufferPtr address which is
*                 passed as parameter.
* @details        Initializes ADC driver with the group specific result buffer
*                 start address where the conversion results will be stored.
*                 The application has to ensure that the application buffer,
*                 where pDataBufferPtr points to, can hold all the conversion
*                 results of the specified group. The initialization with
*                 Adc_SetupResultBuffer is required after reset, before a group
*                 conversion can be started.
*
* @param[in]      Group           Numeric ID of requested ADC channel group.
* @param[in]      pDataBufferPtr   Pointer to result data buffer
*
* @return         Std_ReturnType  Standard return type.
* @retval         E_OK:           Result buffer pointer initialized correctly.
* @retval         E_NOT_OK:       Operation failed or development error
*                                 occurred.
*
* @api
*
* @note           The function Autosar Service ID[hex]: 0x0C.
* @note           Synchronous.
* @note           Re-entrant function.
* @implements  Adc_SetupResultBuffer_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_SetupResultBuffer
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    CONSTP2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) DataBufferPtr
)
{
    /* ADC419 */
    VAR(Std_ReturnType, AUTOMATIC) TempReturn = (Std_ReturnType)E_NOT_OK;
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr = NULL_PTR;

#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndGroup(ADC_SETUPRESULTBUFFER_ID, Group))
    {
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
        if ((Std_ReturnType)E_OK == Adc_ValidatePtr(ADC_SETUPRESULTBUFFER_ID, DataBufferPtr))
        {
        #ifdef ADC_VALIDATE_APP_BUFFER_ALIGNMENT
             if((Std_ReturnType)E_OK == Adc_ValidateSetupBufferAlignment(Group, DataBufferPtr))
             {
        #endif
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

#if (ADC_VALIDATE_STATE == STD_ON)
                if ((Std_ReturnType)E_OK == Adc_ValidateSetupBufferNotBusy(Group))
                {
#endif /* ADC_VALIDATE_STATE == STD_ON */

                    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
                    pGroupPtr = &Adc_pCfgPtr->pGroups[Group];
                    /* ADC420 */
                    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
                    (pGroupPtr->pResultsBufferPtr[Group]) = DataBufferPtr;
                    TempReturn = (Std_ReturnType)E_OK;
#if (ADC_VALIDATE_STATE == STD_ON)
                }
#endif /* ADC_VALIDATE_STATE == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
        #ifdef ADC_VALIDATE_APP_BUFFER_ALIGNMENT
             }
        #endif
        }
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

