xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    }
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */
}
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) || defined(__DOXYGEN__) */

/**
* @brief          Returns the conversion status of the requested ADC Channel group.
* @details        This function will return the conversion status of the requested
*                 ADC channel group.
*
* @param[in]      Group             Numeric ID of requested ADC channel group.
* @return         Adc_StatusType    Conversion status for the requested group.
* @retval         ADC_IDLE          in case of errors.
* @retval         conversion status in case of no errors.
* @api
*
* @note           The function Autosar Service ID[hex]: 0x09.
* @note           Synchronous.
* @note           Re-entrant function.
* @implements     Adc_GetGroupStatus_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Adc_StatusType, ADC_CODE) Adc_GetGroupStatus
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    /* ADC374, ADC140, ADC503, ADC413 */
    VAR(Adc_StatusType, AUTOMATIC) eTempReturn = ADC_IDLE;

#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    /* ADC301, ADC225 */
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndGroup(ADC_GETGROUPSTATUS_ID, Group))
    {
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */
        /* ADC325, ADC224, ADC220 */
        eTempReturn = Adc_aGroupStatus[Group].eConversion;
#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    }
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

    return(eTempReturn);
}

/**
* @brief          Returns the number of valid samples per channel.
* @details        Returns the number of valid samples per channel, stored in
*                 the result buffer. Reads a pointer, pointing to a position
*                 in the group result buffer. With the pointer position, the
*                 results of all group channels of the last completed conversion
*                 round can be accessed. With the pointer and the return value,
*                 all valid group conversion results can be accessed (the user
*                 has to take the layout of the result buffer into account).
*
* @param[in]      Group              Numeric ID of requested ADC channel group.
* @param[out]     PtrToSamplePtr     Pointer to result buffer pointer.
*
* @return         Adc_StreamNumSampleType Number of valid samples per channel.
* @retval         0                 in case of errors.
* @retval         >0                Number of valid samples per channel.
* @api
*
* @note           The function Autosar Service ID[hex]: 0x0B.
* @note           Synchronous.
* @note           Reentrant function.
* @implements     Adc_GetStreamLastPointer_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Adc_StreamNumSampleType, ADC_CODE) Adc_GetStreamLastPointer
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    P2P2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) PtrToSamplePtr
)
{
    /* ADC382, ADC375 */
    /* Number of samples to return */
    VAR(Adc_StreamNumSampleType, AUTOMATIC) NumberOfResults = 0U;
    VAR(Adc_StreamNumSampleType, AUTOMATIC) ResultIndex = 0U;

#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndGroup(ADC_GETSTREAMLASTPOINTER_ID, Group))
    {
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

#if (ADC_VALIDATE_STATE == STD_ON)
        if ((Std_ReturnType)E_OK == Adc_ValidateStateNotIdle(ADC_GETSTREAMLASTPOINTER_ID, Group))
        {
#endif /* ADC_VALIDATE_STATE == STD_ON */

            *PtrToSamplePtr = (Adc_ValueGroupType *)NULL_PTR;

            /** @violates @ref Adc_c_REF_4 only Array indexing shall be allowed */
            if (ADC_IDLE != Adc_aGroupStatus[Group].eConversion)
            {
                /* ADC216 */
                if (ADC_BUSY != Adc_aGroupStatus[Group].eConversion)
                {
                    /* ADC387 */
                    if ((Adc_StreamNumSampleType)0U == Adc_aGroupStatus[Group].ResultIndex)
                    {
                        /** @violates @ref Adc_c_REF_4 only Array indexing shall be allowed */
                        ResultIndex = Adc_pCfgPtr->pGroups[Group].NumSamples - (Adc_StreamNumSampleType)1U;

                        /** @violates @ref Adc_c_REF_4 only Array indexing shall be allowed */
                        NumberOfResults = Adc_pCfgPtr->pGroups[Group].NumSamples;
                    }
                    else
                    {
                        ResultIndex = Adc_aGroupStatus[Group].ResultIndex - (Adc_StreamNumSampleType)1U;
                        NumberOfResults = Adc_aGroupStatus[Group].ResultIndex;
                    }

                    /* ADC214 -- ADC418 -- ADC382*/
                    /** @violates @ref Adc_c_REF_10 cast from pointer to pointer */
                    /** @violates @ref Adc_c_REF_4 only Array indexing shall be allowed */
                    *PtrToSamplePtr = (Adc_ValueGroupType *)(Adc_pCfgPtr->pGroups[Group].pResultsBufferPtr[Group] + \
                                                            ResultIndex \
                                                            );
                    Adc_UpdateStatusAfterGetStream(Group);
                }
            }

#if (ADC_VALIDATE_STATE == STD_ON)
        }
        else
        {
            *PtrToSamplePtr = NULL_PTR;
        }
#endif /* ADC_VALIDATE_STATE == STD_ON */

#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    }
    else
    {
        /* ADC302, ADC218 */
        *PtrToSamplePtr = NULL_PTR;
    }
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

    return (NumberOfResults);
}

#if (ADC_VERSION_INFO_API == STD_ON) || defined(__DOXYGEN__)
/**
* @brief          Returns the version information of this module.
* @details        Returns the version information of this module.
*
* @param[out]     versioninfo    Pointer to where to store the version
*                                 information of this module.
* @retval         structure       in case of no errors.
* @api
*
* @note           The function Autosar Service ID[hex]: 0x0A.
* @note           Synchronous.
* @note           Reentrant function.
* @implements     Adc_GetVersionInfo_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_GetVersionInfo
(
    P2VAR(Std_VersionInfoType , AUTOMATIC, ADC_APPL_DATA) versioninfo
)
/** @violates @ref Adc_c_REF_2 The identifiers used in the declaration and definition of a function shall be identical */
{
    /* ADC376 */
#if (ADC_VALIDATE_PARAMS == STD_ON)
    /* ADC458 */
    if ((Std_ReturnType)E_OK == Adc_ValidatePtr(ADC_GETVERSIONINFO_ID, versioninfo))
    {
#endif /* ADC_VALIDATE_PARAMS == STD_ON */
        /* ADC236 */
        (versioninfo)->vendorID = (uint16)ADC_VENDOR_ID;
        (versioninfo)->moduleID = (uint16)ADC_MODULE_ID;
        (versioninfo)->sw_major_version = (uint8)ADC_SW_MAJOR_VERSION;
        (versioninfo)->sw_minor_version = (uint8)ADC_SW_MINOR_VERSION;
        (versioninfo)->sw_patch_version = (uint8)ADC_SW_PATCH_VERSION;

#if (ADC_VALIDATE_PARAMS == STD_ON)
    }
#endif /* ADC_VALIDATE_PARAMS == STD_ON */
}
#endif /* (ADC_VERSION_INFO_API == STD_ON) || defined(__DOXYGEN__) */

#if (ADC_POWER_STATE_SUPPORTED == STD_ON) || defined(__DOXYGEN__)
/**
* @brief          Enters the already prepared power state.
* @details        This API configures the Adc module so that it enters the already prepared power
*                 state, chosen between a predefined set of configured ones.
*
* @param[out]     Result        Pointer to a variable to store the result of this function
*
* @return         Std_ReturnType  Standard return type.
* @retval         E_OK:           Power Mode changed.
* @retval         E_NOT_OK:       Request rejected.
*
* @api
*
* @post           Enters the already prepared power state.
*
*
* @note           The function Autosar Service ID[hex]: 0x10.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements     Adc_SetPowerState_Activity
*
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_SetPowerState
(
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) Result
)
{
    /* ADC475, ADC481 */
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_NOT_OK;

    if((Std_ReturnType)E_OK == Adc_ValidateStateAndPtr(ADC_SETPOWERSTATE_ID, Result))
    {
        if((Std_ReturnType)E_OK == Adc_ValidatePowerStatePrepare(ADC_SETPOWERSTATE_ID, Result))
        {
            if((Std_ReturnType)E_OK == Adc_ValidatePowerStateSupport(ADC_SETPOWERSTATE_ID, Adc_eTargetState, Result))
            {
                if((Std_ReturnType)E_OK == Adc_ValidateIdleState(ADC_SETPOWERSTATE_ID, Result))
                {
                    if(Adc_eCurrentState == Adc_eTargetState)
                    {
                        /* ADC482 (ADC482) :The target state is the same as the current one, return a E_OK and no action is executed  */
                        *Result = ADC_SERVICE_ACCEPTED;
                        Adc_eTargetState = ADC_NODEFINE_POWER;
                        RetVal=(Std_ReturnType)E_OK;
                    }
                    else
                    {
                        RetVal = Adc_Ipw_SetPowerState(Adc_eTargetState);
                        if((Std_ReturnType)E_OK == RetVal)
                        {
                        /* ADC482 */
                        /* Everything is ok */
                            *Result = ADC_SERVICE_ACCEPTED;
                            Adc_eCurrentState = Adc_eTargetState;
                            Adc_eTargetState = ADC_NODEFINE_POWER;
                        }
                        else
                        {
                            #if (ADC_DEV_ERROR_DETECT == STD_ON)
                            Adc_ReportDetRuntimeError(ADC_SETPOWERSTATE_ID, ADC_E_TRANSITION_NOT_POSSIBLE);
                            #endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
                            /* Hardware failure */
                            *Result = ADC_HW_FAILURE;
                        }
                    }
                }
            }
        }
    }

    return RetVal;
}

/**
* @brief          Get the current power state of the ADC HW unit.
* @details        This API returns the current power state of the ADC HW unit.
*
* @param[out]     CurrentPowerState     The current power mode of the ADC HW Unit is returned in this parameter
* @param[out]     Result                Pointer to a variable to store the result of this function
*
* @return         Std_ReturnType  Standard return type.
* @retval         E_OK:           Mode could be read.
* @retval         E_NOT_OK:       Service is rejected.
*
* @api
*
* @post           Returns the current power state of the ADC HW unit.
*
*
* @note           The function Autosar Service ID[hex]: 0x11.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements     Adc_GetCurrentPowerState_Activity
*
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_GetCurrentPowerState
(
    P2VAR(Adc_PowerStateType, AUTOMATIC, ADC_APPL_DATA) CurrentPowerState,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) Result
)
{
    /* ADC476 */
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_NOT_OK;

