xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
    if((Std_ReturnType)E_OK == Adc_ValidateStateAndPtr(ADC_GETCURRENTPOWERSTATE_ID, Result))
    {
#if (ADC_VALIDATE_PARAMS == STD_ON)
        if ((Std_ReturnType)E_OK == Adc_ValidatePtr(ADC_GETCURRENTPOWERSTATE_ID, CurrentPowerState))
#endif /* (ADC_VALIDATE_PARAMS == STD_ON) */
        {
            *CurrentPowerState = Adc_eCurrentState;
            *Result = ADC_SERVICE_ACCEPTED;
            RetVal = (Std_ReturnType)E_OK;
        }
    }
    return RetVal;
}

/**
* @brief          Get the target power state of the ADC HW unit.
* @details        This API returns the target power state of the ADC HW unit.
*
* @param[out]     TargetPowerState      The Target power mode of the ADC HW Unit is returned in this parameter.
* @param[out]     Result                Pointer to a variable to store the result of this function.
*
* @return         Std_ReturnType  Standard return type.
* @retval         E_OK:           Mode could be read.
* @retval         E_NOT_OK:       Service is rejected.
*
* @api
*
* @post           Returns the target power state of the ADC HW unit.
*
*
* @note           The function Autosar Service ID[hex]: 0x12.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements     Adc_GetTargetPowerState_Activity
*
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_GetTargetPowerState
(
    P2VAR(Adc_PowerStateType, AUTOMATIC, ADC_APPL_DATA) TargetPowerState,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) Result
)
{
    /* ADC477 */
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_NOT_OK;

    if((Std_ReturnType)E_OK == Adc_ValidateStateAndPtr(ADC_GETTARGETPOWERSTATE_ID, Result))
    {
#if (ADC_VALIDATE_PARAMS == STD_ON)
        if ((Std_ReturnType)E_OK == Adc_ValidatePtr(ADC_GETTARGETPOWERSTATE_ID, TargetPowerState))
#endif /* (ADC_VALIDATE_PARAMS == STD_ON) */
        {
            /* ADC492 */
            if(Adc_eTargetState < ADC_NODEFINE_POWER)
            {
                /* A transition is ongoing */
                *TargetPowerState = Adc_eTargetState;
            }
            else
            {
                /* No transition is ongoing */
                *TargetPowerState = Adc_eCurrentState;
            }
            *Result = ADC_SERVICE_ACCEPTED;
            RetVal = (Std_ReturnType)E_OK;
        }
    }
    return RetVal;
}

/**
* @brief          Starts the needed process to allow the ADC HW module to enter the requested power state.
* @details        This API starts the needed process to allow the ADC HW module to enter the requested power state.
*
* @param[in]      PowerState      The target power state intended to be attained.
* @param[out]     Result          Pointer to a variable to store the result of this function.
*
* @return         Std_ReturnType  Standard return type.
* @retval         E_OK:           Mode could be read.
* @retval         E_NOT_OK:       Service is rejected.
*
* @api
*
* @post           Starts the needed process to allow the ADC HW module to enter the requested power state.
*
*
* @note           The function Autosar Service ID[hex]: 0x13.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements     Adc_PreparePowerState_Activity
*
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_PreparePowerState
(
    VAR(Adc_PowerStateType, AUTOMATIC) PowerState,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) Result
)
{
    /* ADC478 */
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_NOT_OK;

    if((Std_ReturnType)E_OK == Adc_ValidateStateAndPtr(ADC_PREPAREPOWERSTATE_ID, Result))
    {
        if((Std_ReturnType)E_OK == Adc_ValidatePowerStateSupport(ADC_PREPAREPOWERSTATE_ID, PowerState, Result))
        {
            /* ADC495 */
            /* Everything is ok */
            Adc_eTargetState = PowerState;
            *Result = ADC_SERVICE_ACCEPTED;
            RetVal = (Std_ReturnType)E_OK;
        }
    }
    return RetVal;
}

#if (ADC_POWER_STATE_ASYNCH_MODE_SUPPORTED == STD_ON) || defined(__DOXYGEN__)
/**
* @brief          Cyclically called and supervises the power state transitions.
* @details        This API is cyclically called and supervises the power state transitions, checking for the readiness of the module and issuing the callbacks.
*
* @param[in]      none
* @param[out]     none
*
* @return         none
*
* @api
*
* @post           Cyclically called and supervises the power state transitions.
*
*
* @note           The function Autosar Service ID[hex]: 0x14.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements     Adc_Main_PowerTransitionManager_Activity
*
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_Main_PowerTransitionManager(void)
{

}
#endif /* (ADC_POWER_STATE_ASYNCH_MODE_SUPPORTED == STD_ON) */
#endif /* (ADC_POWER_STATE_SUPPORTED == STD_ON) || defined(__DOXYGEN__) */

#if (ADC_SET_MODE_API == STD_ON) || defined(__DOXYGEN__)
/**
* @brief          Set the ADC mode either to powerdown or normal.
* @details        Set the ADC either to powerdown or normal mode.
*
* @param[in]      SetMode         Normal or powerdown mode.
*
* @return         Std_ReturnType  Standard return type.
* @retval         E_OK:           In case of successful settings.
* @retval         E_NOT_OK:       In case of unsuccessful settings.
*
* @api
*
* @note           The function Non Autosar Service ID[hex]: 0x10.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements     Adc_SetMode_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_SetMode
(
    VAR(Adc_SetModeType, AUTOMATIC) SetMode
)
{
    /* PR-MCAL-3171.adc */
    /* Return standard value */
    VAR(Std_ReturnType, AUTOMATIC) TempReturn = (Std_ReturnType)E_NOT_OK;
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = 0U;
    VAR(Adc_HwUnitType, AUTOMATIC) HwIndex = 0U;

    if ((Std_ReturnType)E_OK == Adc_ValidateSetMode(SetMode))
    {
        for(HwIndex = 0U; HwIndex < Adc_pCfgPtr->Misc.Adc_MaxHwCfg; HwIndex++)
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            Unit = Adc_pCfgPtr->pAdc[HwIndex].AdcHardwareUnitId;
            TempReturn = Adc_ValidateNotBusyNoQueue(Unit, ADC_SETMODE_ID);
            if ((Std_ReturnType)E_NOT_OK == TempReturn)
            {
                break;
            }
        }
        if ((Std_ReturnType)E_OK == TempReturn)
        {
            if ((Std_ReturnType)E_OK == Adc_ValidateCheckGroupNotConversion(ADC_SETMODE_ID))
            {
                TempReturn = Adc_Ipw_SetMode(SetMode);
            }
        }
    }
    return TempReturn;
}
#endif /* (ADC_SET_MODE_API == STD_ON) || defined(__DOXYGEN__) */

#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) || defined(__DOXYGEN__)
/**
* @brief          Enable the TriggerSource for group selected by Group parameter.
* @details        This non Autosar API is used to enable any one of the configured
*                 TriggerSource of the Group. When this non Autosar API is used to
*                 enable the trigger source the CTU interrupt will be disabled by the driver.
*                 So user has to call the non Autosar API Adc_HwResultReadGroup to read
*                 the converted result from the ADC hardware register.
*
* @param[in]      Group            Index of group.
* @param[in]      TriggerSource    Trigger source to be used for the group.
*                                  (Configuration file should contain it for that group).
* @return         void
*
* @api
*
* @note           The function Service ID[hex]: 0x0E.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements     Adc_EnableCTUTrigger_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_EnableCTUTrigger
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwTriggerTimerType, AUTOMATIC) TriggerSource
)
{
#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndGroup(ADC_ENABLECTUTRIGGER_ID, Group))
    {
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

#if (ADC_VALIDATE_STATE == STD_ON)
        if ((Std_ReturnType)E_OK == Adc_ValidateNotBusyEnableCtuTrig(Group))
        {
#endif /* ADC_VALIDATE_STATE == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
            if ((Std_ReturnType)E_OK == Adc_ValidateExtraParams(ADC_ENABLECTUTRIGGER_ID,
                                                                ADC_E_WRONG_TRIGG_SRC_LIST | \
                                                                ADC_E_WRONG_CONV_MODE_LIST,
                                                                Group
                                                               )
               )
            {
                if ((Std_ReturnType)E_OK == Adc_ValidateCtuTriggerSrc(ADC_ENABLECTUTRIGGER_ID, Group, TriggerSource))
                {
#endif /* ADC_VALIDATE_PARAMS == STD_ON */
                    Adc_Ipw_EnableCtuTrigger(Group, TriggerSource);
#if (ADC_VALIDATE_PARAMS == STD_ON)
                }
            }
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

#if (ADC_VALIDATE_STATE == STD_ON)
        }
#endif /* ADC_VALIDATE_STATE == STD_ON */

