xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    }
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */
}

/**
* @brief          Disable a channel inside a group.
* @details        This function allows to de-active a channel assigned to a group for SW normal
*                 conversion
*
* @param[in]      Group        Symbolic name of group.
* @param[in]      Channel      Symbolic name of channel.
*
* @return         void
*
* @api
* @note           The function Service ID[hex]: 0x13.
* @note           Synchronous.
* @note           Re-entrant function.
* @implements     Adc_DisableChannel_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_DisableChannel
(
    VAR(Adc_GroupType, AUTOMATIC)Group,
    VAR(Adc_ChannelType, AUTOMATIC)Channel
)
{
    /* PR-MCAL-3233.adc, ADC413 */
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = 0U;
    VAR(Adc_ChannelType, AUTOMATIC) ChId;
    VAR(Adc_GroupType, AUTOMATIC) GroupId = ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX;
    VAR(Adc_NcmrType , AUTOMATIC) CmrMask;

#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndGroup(ADC_DISABLE_CHANNEL_ID, Group))
    {
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
        if ((Std_ReturnType)E_OK == Adc_ValidateExtraParams(ADC_DISABLE_CHANNEL_ID,
                                                            ADC_E_WRONG_TRIGG_SRC_LIST | \
                                                            ADC_E_WRONG_CONV_MODE_LIST | \
                                                            ADC_E_WRONG_ENABLE_CH_DISABLE_CH_GROUP_LIST | \
                                                            ADC_E_WRONG_ENABLE_CH_DISABLE_CH_ID_LIST, \
                                                            Group \
                                                           )
           )
        {
            if ((Std_ReturnType)E_OK == Adc_ValidateEnableDisbleIdList(ADC_DISABLE_CHANNEL_ID, Group, Channel))
            {
#endif /* ADC_VALIDATE_PARAMS == STD_ON */
                /** @violates @ref Adc_c_REF_4 Array indexing */
                Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
                /** @violates @ref Adc_c_REF_4 Array indexing */
                ChId = Adc_pCfgPtr->pChannels[Unit][Channel].ChId;
                /** @violates @ref Adc_c_REF_4 Array indexing */
                GroupId = (Adc_GroupType)Adc_pCfgPtr->pGroups[Group].EnableChDisableChGroupIndex;

                /** @violates @ref Adc_c_REF_7 It is needed for calculation value of go back space for source address.*/
                Adc_GetCmrRegister(Unit, Group, &CmrMask);
                if (ChId < ADC_ST_EXTENDED_CH_U8)
                {   /* Precision channel */
                    Adc_aNCMRxMask[GroupId].Adc_u32NCMR0 = (CmrMask.Adc_u32NCMR0 & (~((uint32)1UL << ChId)));
                }
                else if ((ChId >= ADC_ST_EXTENDED_CH_U8) && (ChId <= ADC_ED_EXTENDED_CH_U8))
                {   /* Standard channel */
                    Adc_aNCMRxMask[GroupId].Adc_u32NCMR1 = (CmrMask.Adc_u32NCMR1 & (~((uint32)1UL << (ChId - ADC_ST_EXTENDED_CH_U8))));
                }
                else if ((ChId >= ADC_ST_EXTERNAL_CH_U8) && (ChId <= ADC_ED_EXTERNAL_CH_U8))
                {   /* External multiplexed channel */
                    Adc_aNCMRxMask[GroupId].Adc_u32NCMR2 = (CmrMask.Adc_u32NCMR2 & (~((uint32)1UL << (ChId - ADC_ST_EXTERNAL_CH_U8))));
                }
                else
                {
                    /* nothing for misra */
                }
#if (ADC_VALIDATE_PARAMS == STD_ON)
            }
        }
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    }
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */
}
#endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) || defined(__DOXYGEN__) */

#if (ADC_GET_INJECTED_CONVERSION_STATUS_API == STD_ON) || defined(__DOXYGEN__)
/**
* @brief          Get the injected conversions status.
* @details        This function checks if an injected conversion (HW,SW) is ongoing
*
* @param[in]      unit            ADC Unit id.
*
* @return         Adc_StatusType  Status of the ADC HW unit.
* @retval         ADC_IDLE:       SW,HW Injection or Hardware Trigger group are idle.
* @retval         ADC_BUSY:       SW,HW Injection or Hardware Trigger is inprogress.
*
* @api
* @note           The function Service ID[hex]: 0x14.
* @note           Synchronous.
* @note           Re-entrant function.
* @implements     Adc_GetInjectedConversionStatus_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Adc_StatusType, ADC_CODE) Adc_GetInjectedConversionStatus
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    /* CPR-MCAL-730.adc, ADC413 */
    VAR(Adc_StatusType, AUTOMATIC) eTempReturn = (Adc_StatusType)ADC_IDLE;

#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_GETINJECTEDCONVERSIONSTATUS_ID, Unit))
    {
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */

        if (Adc_aUnitStatus[Unit].SwInjectedQueueIndex > (Adc_QueueIndexType)0)
        {
            eTempReturn = (Adc_StatusType)ADC_BUSY;
        }
#if (ADC_HW_TRIGGER_API == STD_ON)
        else if (Adc_aUnitStatus[Unit].HwInjectedQueueIndex > (Adc_QueueIndexType)0)
        {
            eTempReturn = (Adc_StatusType)ADC_BUSY;
        }
#endif
        else
        {
            /* nothing for Mirsa */
        }

#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    }
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */

    return (eTempReturn);
}
#endif /* (ADC_GET_INJECTED_CONVERSION_STATUS_API) || defined(__DOXYGEN__) */

#if (ADC_CALIBRATION == STD_ON)
/**
* @brief          Executes high accuracy calibration of a ADC HW unit.
* @details        This function calibrates the ADC HW unit and updates calibration related registers
*
* @param[in]      Unit      ADC Unit Id.
* @param[in]      pStatus    Status of the ADC HW unit calibration and
*                           list of failed and passed tests.
*
* @return         void
*
* @api
*
* @note           The function Service ID[hex]: 0x15.
* @implements  Adc_Calibrate_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_Calibrate
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    P2VAR(Adc_CalibrationStatusType , AUTOMATIC, ADC_APPL_DATA) pStatus
)
{
    /* SMCAL_SW121.adc, PR-MCAL-3012.adc */
#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_CALIBRATE_ID, Unit))
    {
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
        if ((Std_ReturnType)E_OK == Adc_ValidatePtr(ADC_CALIBRATE_ID, pStatus))
        {
#endif /* ADC_VALIDATE_PARAMS == STD_ON */
            if ((Std_ReturnType)E_OK == Adc_ValidateNotBusyNoQueue(Unit, ADC_CALIBRATE_ID))
            {

