xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    if (NULL_PTR == Adc_pCfgPtr)
    {
        Adc_ReportDetError((uint8)ADC_SETCLOCKMODE_ID, (uint8)ADC_E_UNINIT);
    }
    else if ((ADC_NORMAL != eClockMode) && (ADC_ALTERNATE != eClockMode))
    {
        Adc_ReportDetError((uint8)ADC_SETCLOCKMODE_ID, (uint8)ADC_E_INVALID_CLOCK_MODE);
    }
    else
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
    {
        for(HwIndex = 0U; HwIndex < Adc_pCfgPtr->Misc.Adc_MaxHwCfg; HwIndex++)
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            Unit = Adc_pCfgPtr->pAdc[HwIndex].AdcHardwareUnitId;
            ErrorFound = Adc_ValidateNotBusyNoQueue(Unit, ADC_SETCLOCKMODE_ID);
            if ((Std_ReturnType)E_NOT_OK == ErrorFound)
            {
                break;
            }
        }
        if ((Std_ReturnType)E_OK == ErrorFound)
        {
            if ((Std_ReturnType)E_OK == Adc_ValidateCheckGroupNotConversion(ADC_SETCLOCKMODE_ID))
            {

                Ret = Adc_Ipw_SetClockMode(eClockMode);
#if (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)
                Adc_eClockMode = eClockMode;
#endif

            }
        }
    }
    return Ret;
}
#endif /* (ADC_DUAL_CLOCK_MODE == STD_ON) */

#if (CTUV2_ENABLE_TRIGGER_CONFIGURATION_APIS == STD_ON)
/**
 * @brief   Function to set the trigger handler control registers of the CTUV2 IP.
 *
 * @details Full configurability of CTU THCR1 & THCR2 registers of the CTUv2 IP.
 *          This function has in input the CTU trigger (0...7) and the mask (8 bit)
 *          to enable the External Trigger and Timer output for that Trigger, without considering
 *          the ADC command output enable.
 *          See from the RM the THCR1 and THCR2 registers for the right Thcr_value to use.
 *
 * @note    The function Service ID[hex]: 0x35.
 *
 * @param[in]  Trigger      Index of the trigger: 0...7.
 * @param[in]  ThcrValue   THCRx mask value (only with bits for Ext. Trigger and Timer) for the selected input trigger.
 *
 * @return         Std_ReturnType  E_OK or E_NOT_OK.
 * @retval         E_OK            In case of successful settings.
 * @retval         E_NOT_OK        In case of unsuccessful settings.
 *
 * @implements Adc_SetCTU2TriggerHandlerCtrlRegs_Activity
 *
 * @api
 */
/** @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required */
/** @violates @ref Adc_c_REF_5 Identifier clash */
FUNC(Std_ReturnType, ADC_CODE) Adc_SetCtu2TriggerHandlerCtrlRegs
(
    VAR(uint8, AUTOMATIC) u8Trigger,
    VAR(uint8, AUTOMATIC) u8ThcrValue
)
{
    /* PR-MCAL-3312.adc */
    VAR(Std_ReturnType, AUTOMATIC) Ret = (Std_ReturnType)E_OK;

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    Ret = Adc_ValidateCallAndTrigger(CTUV2_SET_TRG_HANDLER_CTRL_REGS_ID, u8Trigger);
    if((Std_ReturnType)E_OK == Ret)
#endif
    {
        Ret = Adc_Ipw_SetCtu2TriggerHandlerCtrlRegs(u8Trigger, u8ThcrValue);
    }
    return Ret;
}

/**
* @brief   Function to set or clear the bit Tx_E of the trigger handler control registers of the CTUV2 IP.
 *
 * @details Full configurability of CTU THCR1 & THCR2 registers of the CTUv2 IP.
 *          This function has in input the CTU trigger (0...7) and a Boolean to set to clear the right trigger bit.
 *          See from the RM the THCR1 and THCR2 registers for the right API use.
 *
 * @param[in]  Trigger      Index of the trigger: 0...7.
 * @param[in]  bEnable      if True, the bit Tx_E shall be set to 1, 0 otherwise
 *
 * @note    The function Service ID[hex]: 0x36.
 *
 * @return         Std_ReturnType  E_OK or E_NOT_OK.
 * @retval         E_OK            In case of successful settings.
 * @retval         E_NOT_OK        In case of unsuccessful settings.
 *
 * @implements Adc_CTU2TriggerHandlerCtrlRegsEnableDisable_Activity
 *
 * @api
 */
/** @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
 * functions at file scope shall have internal linkage unless external linkage is required
 * @violates @ref Adc_c_REF_5 Identifier clash
 */
FUNC(Std_ReturnType, ADC_CODE) Adc_Ctu2TriggerHandlerCtrlRegsEnableDisable
(
    VAR(uint8, AUTOMATIC) u8Trigger,
    VAR(boolean, AUTOMATIC) bEnable
)
{
    /* PR-MCAL-3312.adc */
    VAR(Std_ReturnType, AUTOMATIC) Ret = (Std_ReturnType)E_OK;

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    Ret = Adc_ValidateCallAndTrigger(CTUV2_EN_DIS_TRG_HANDLER_CTRL_REGS_ID, u8Trigger);
    if((Std_ReturnType)E_OK == Ret)
#endif
    {
        Ret = Adc_Ipw_Ctu2TriggerHandlerCtrlRegsEnableDisable(u8Trigger, bEnable);
    }
    return Ret;
}

/**
* @brief   Function to set the cmd list handler control registers of the CTUV2 IP.
 *
 * @details Full configurability of CLCR1 & CLCR2 registers of the CTUv2 IP.
 *          This function has in input the CTU trigger (0...7) and  the position of the first
 *          command in the command list.
 *          See from the RM the CLCR1 and CLCR2 registers for the right API use.
 *
 * @param[in]  u8Trigger      Index of the trigger: 0...7.
 * @param[in]  u8ClcrValue   Position of the first command
 *
 * @note    The function Service ID[hex]: 0x37.
 *
 * @return         Std_ReturnType  E_OK or E_NOT_OK.
 * @retval         E_OK            In case of successful settings.
 * @retval         E_NOT_OK        In case of unsuccessful settings.
 *
 * @implements Adc_SetCTU2CmdListHandlerCtrlRegs_Activity
 *
 * @api
 */
/** @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
 * functions at file scope shall have internal linkage unless external linkage is required
 * @violates @ref Adc_c_REF_5 Identifier clash
 */
FUNC(Std_ReturnType, ADC_CODE) Adc_SetCtu2CmdListHandlerCtrlRegs
(
    VAR(uint8, AUTOMATIC) u8Trigger,
    VAR(uint8, AUTOMATIC) u8ClcrValue
)
{
    /* PR-MCAL-3313.adc */
    VAR(Std_ReturnType, AUTOMATIC) Ret = (Std_ReturnType)E_OK;

