xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    Ret = Adc_ValidateCallAndTrigger(CTUV2_SET_CMD_LIST_HANDLER_CTRL_REGS_ID, u8Trigger);
    if((Std_ReturnType)E_OK == Ret)
    {
        if ((uint32)u8ClcrValue > CTU2_CLCR_MAX_VALUE_U8)
        {
            Adc_ReportDetError(CTUV2_SET_CMD_LIST_HANDLER_CTRL_REGS_ID, ADC_E_WRONG_CTUV2_CLCR_TRIGGER);
            Ret = (Std_ReturnType)E_NOT_OK;
        }
    }
    if((Std_ReturnType)E_OK == Ret)
#endif
    {
        Ret = Adc_Ipw_SetCtu2CmdListHandlerCtrlRegs(u8Trigger, u8ClcrValue);
    }
    return Ret;
}
/**
 * @brief   Function to set the trigger compare registers of the CTUV2 IP.
 *
 * @details Full configurability of CTU TxCR registers of the CTUv2 IP.
 *          This function has in input the CTU trigger (0...7) and the comparator value
 *          See from the RM the TxCR trigger compare registers for the right compare_value to use.
 *
 * @note    The function Service ID[hex]: 0x38.
 *
 * @param[in]  u8Trigger      Index of the trigger: 0...7.
 * @param[in]  u16CompareValue  value to set in the register TxCR.
 *
 * @return         Std_ReturnType  E_OK or E_NOT_OK.
 * @retval         E_OK            In case of successful settings.
 * @retval         E_NOT_OK        In case of unsuccessful settings.
 *
 * @implements Adc_SetCTU2TriggerCompareRegs_Activity
 *
 * @api
 */
 /** @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required */
FUNC(Std_ReturnType, ADC_CODE) Adc_SetCtu2TriggerCompareRegs
(
    VAR(uint8, AUTOMATIC) u8Trigger,
    VAR(uint16, AUTOMATIC) u16CompareValue
)
{
    /* PR-MCAL-3314.adc */
    VAR(Std_ReturnType, AUTOMATIC) Ret = (Std_ReturnType)E_OK;

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    Ret = Adc_ValidateCallAndTrigger(CTUV2_SET_TRIGGER_COMPARE_REGS_ID, u8Trigger);
    if((Std_ReturnType)E_OK == Ret)
#endif
    {
        Ret = Adc_Ipw_SetCtu2TriggerCompareRegs(u8Trigger, u16CompareValue);
    }
    return Ret;
}
#endif /* if (CTUV2_ENABLE_TRIGGER_CONFIGURATION_APIS == STD_ON)  */

#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
/**
 * @brief   Function to enable CTU control mode for an ADC unit.
 *
 * @details Enable CTU control mode for an ADC unit.
 *          This function to enable CTU control mode for Adc. When a unit works in CTU control mode,
 *          no other conversions shall run in parallel(Adc). The only conversions occurring shall be
 *          the ones defined in the CTU configuration.
 *
 * @param[in]  Unit      ADC Unit Id.
 *
 * @note    The function Service ID[hex]: 0x39.
 *
 * @implements Adc_EnableCtuControlMode_Activity
 *
 * @api
 */
/** @violates @ref Adc_c_REF_3 internal linkage vs external linkage. */
FUNC(void, ADC_CODE) Adc_EnableCtuControlMode
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    /* CPR-MCAL-726.adc */
#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_ENABLECTUCONTROLMODE_ID, Unit))
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    {
        if ((Std_ReturnType)E_OK == Adc_ValidateUnitActive(ADC_ENABLECTUCONTROLMODE_ID, Unit))
        {
            if ((Std_ReturnType)E_OK == Adc_ValidateStateCtuControlMode(ADC_ENABLECTUCONTROLMODE_ID, Unit))
            {
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
                Adc_Ipw_EnableCtuControlMode(Unit);
#if (ADC_DEV_ERROR_DETECT == STD_ON)
            }
        }
    }
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
}
/**
 * @brief   Function to disable CTU control mode for an ADC unit.
 *
 * @details Disable CTU control mode for an ADC unit.
 *          This function to disable CTU control mode for Adc. The other Adc conversions can run in
 *          software trigger normal mode, software trigger injected mode or hardware trigger mode.
 *
 * @param[in]  Unit      ADC Unit Id.
 *
 * @note    The function Service ID[hex]: 0x4A.
 *
 * @implements Adc_DisableCtuControlMode_Activity
 *
 * @api
 */
/** @violates @ref Adc_c_REF_3 internal linkage vs external linkage. */
FUNC(void, ADC_CODE) Adc_DisableCtuControlMode
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    /* CPR-MCAL-726.adc */
#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_DISABLECTUCONTROLMODE_ID, Unit))
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    {
        if ((Std_ReturnType)E_OK == Adc_ValidateUnitActive(ADC_DISABLECTUCONTROLMODE_ID, Unit))
        {
            if ((Std_ReturnType)E_OK == Adc_ValidateStateCtuControlMode(ADC_DISABLECTUCONTROLMODE_ID, Unit))
            {
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
                Adc_Ipw_DisableCtuControlMode(Unit);
#if (ADC_DEV_ERROR_DETECT == STD_ON)
            }
        }
    }
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
}
#endif /* ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON */

#if (ADC_SETCHANNEL_API == STD_ON)
/**
 * @brief   Function to dynamic handling of ADC channels list for Adc channel group.
 *
 * @details Dynamic handling of ADC channels list.
 *          This function to dynamic handling of ADC channels list for Adc channel group.
 *
 * @param[in]  Group                Group Id.
 * @param[in]  pChannel             Pointer to channel list array.
 * @param[in]  NumberOfChannel      Number of Channel.
 *
 * @note    The function Service ID[hex]: 0x4B.
 *
 * @implements Adc_SetChannel_Activity
 *
 * @api
 * @violates @ref Adc_c_REF_3 internal linkage vs external linkage.
 */
FUNC(void, ADC_CODE) Adc_SetChannel
(
    CONST(Adc_GroupType, AUTOMATIC) Group,
    P2CONST(Adc_GroupDefType, AUTOMATIC, ADC_APPL_CONST) pChannel,
    P2CONST(uint16, AUTOMATIC, ADC_APPL_CONST) pDelays,
    CONST(uint32, AUTOMATIC) u32Mask,
    CONST(Adc_ChannelIndexType, AUTOMATIC) NumberOfChannel
)
{
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndGroup(ADC_SETCHANNEL_ID, Group))
    {
    #if (defined(ADC_PDB_SUPPORTED) || defined(ADC_PTUV3_SUPPORTED))
        if((NULL_PTR == pChannel) || (NULL_PTR == pDelays))
    #else
        if(NULL_PTR == pChannel)
    #endif /* (defined(ADC_PDB_SUPPORTED) || defined(ADC_PTUV3_SUPPORTED)) */
        {
            Adc_ReportDetError(ADC_SETCHANNEL_ID, (uint8)ADC_E_PARAM_POINTER);
        }
        else if((0U == NumberOfChannel)
                #ifdef ADC_PDB_SUPPORTED
                || (NumberOfChannel > ADC_NUM_SC1n_REGISTER_USED)
                #endif
                #ifdef ADC_PTUV3_SUPPORTED
                /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
                || (NumberOfChannel > Adc_pCfgPtr->pGroups[Group].AssignedChannelCount)
                #endif
               )
        {
            Adc_ReportDetError(ADC_SETCHANNEL_ID, (uint8)ADC_E_PARAM_CHANNEL);
        }
        else
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
        {
            Adc_aRuntimeGroupChannel[Group].pChannel = pChannel;
        #if (defined(ADC_PDB_SUPPORTED) || defined(ADC_PTUV3_SUPPORTED))
            Adc_aRuntimeGroupChannel[Group].pu16Delays = pDelays;
            #ifdef ADC_PDB_SUPPORTED
            Adc_aRuntimeGroupChannel[Group].u32Mask = u32Mask;
            #else
            (void)u32Mask;  /* Avoid compiler warning */
            #endif
        #else
            (void)pDelays;  /* Avoid compiler warning */
            (void)u32Mask;  /* Avoid compiler warning */
        #endif /* (defined(ADC_PDB_SUPPORTED) || defined(ADC_PTUV3_SUPPORTED)) */
            Adc_aRuntimeGroupChannel[Group].ChannelCount = NumberOfChannel;
            Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated = (boolean) TRUE;
        }
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    }
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
}
#endif /* ADC_SETCHANNEL_API == STD_ON */

