xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc.c
#ifndef ADC_CMR_REGISTER_NOT_SUPPORTED
FUNC(void, ADC_CODE) Adc_GetCmrRegister
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    P2VAR(Adc_NcmrType , AUTOMATIC, ADC_APPL_DATA) pCmrMask
)
{
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    VAR(Adc_GroupType, AUTOMATIC) Adc_IndividualGroupId;
#endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
#if (ADC_SETCHANNEL_API == STD_ON)
    VAR(Adc_ChannelType, AUTOMATIC) ChId;
    VAR(Adc_ChannelIndexType, AUTOMATIC) Ch;
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) || (ADC_SETCHANNEL_API == STD_OFF)
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr =  &(Adc_pCfgPtr->pGroups[Group]);
#endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) || (ADC_SETCHANNEL_API == STD_OFF) */

    (void)Unit;

    pCmrMask->Adc_u32NCMR0 = 0UL;
#if ((ADC_NCMR1_AVAILABLE == STD_ON) || (ADC_JCMR1_AVAILABLE == STD_ON))
    pCmrMask->Adc_u32NCMR1 = 0UL;
#endif
#if ((ADC_NCMR2_AVAILABLE == STD_ON) || (ADC_JCMR2_AVAILABLE == STD_ON))
    pCmrMask->Adc_u32NCMR2 = 0UL;
#endif

    /* If the Individual group channel enable capability is ON*/
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    Adc_IndividualGroupId = pGroupPtr->EnableChDisableChGroupIndex;
    if(ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX != Adc_IndividualGroupId)
    {
        pCmrMask->Adc_u32NCMR0 = Adc_aNCMRxMask[Adc_IndividualGroupId].Adc_u32NCMR0;
        pCmrMask->Adc_u32NCMR1 = Adc_aNCMRxMask[Adc_IndividualGroupId].Adc_u32NCMR1;
        pCmrMask->Adc_u32NCMR2 = Adc_aNCMRxMask[Adc_IndividualGroupId].Adc_u32NCMR2;
    }
    else
#endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
    {
#if (ADC_SETCHANNEL_API == STD_ON)
        for(Ch = 0U; Ch < Adc_aRuntimeGroupChannel[Group].ChannelCount; Ch++)
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            ChId = Adc_pCfgPtr->pChannels[Unit][Adc_aRuntimeGroupChannel[Group].pChannel[Ch]].ChId;
            if(ChId < ADC_ST_EXTENDED_CH_U8)
            {
                pCmrMask->Adc_u32NCMR0 |= (uint32)(1UL << (uint32)ChId);
            }
            #if ((ADC_NCMR1_AVAILABLE == STD_ON) || (ADC_JCMR1_AVAILABLE == STD_ON))
            else if ((ChId >= ADC_ST_EXTENDED_CH_U8) && (ChId <= ADC_ED_EXTENDED_CH_U8))
            {
                pCmrMask->Adc_u32NCMR1 |= (uint32)(1UL << ((uint32)ChId - ADC_ST_EXTENDED_CH_U8));
            }
            #endif
            #if ((ADC_NCMR2_AVAILABLE == STD_ON) || (ADC_JCMR2_AVAILABLE == STD_ON))
            else if ((ChId >= ADC_ST_EXTERNAL_CH_U8) && (ChId <= ADC_ED_EXTERNAL_CH_U8))
            {
                pCmrMask->Adc_u32NCMR2 |= (uint32)(1UL << ((uint32)ChId - ADC_ST_EXTERNAL_CH_U8));
            }
            #endif
            else
            {
                /* do nothing to avoid misra */
            }
        }
#else
        /* Program the mask registers */
        pCmrMask->Adc_u32NCMR0 = pGroupPtr->u32PrecisionChannel;
        #if ((ADC_NCMR1_AVAILABLE == STD_ON) || (ADC_JCMR1_AVAILABLE == STD_ON))
        pCmrMask->Adc_u32NCMR1 = pGroupPtr->u32ExtendedChannel;
        #endif /* ((ADC_NCMR1_AVAILABLE == STD_ON) || (ADC_JCMR1_AVAILABLE == STD_ON)) */
        #if ((ADC_NCMR2_AVAILABLE == STD_ON) || (ADC_JCMR2_AVAILABLE == STD_ON))
        pCmrMask->Adc_u32NCMR2 = pGroupPtr->u32ExternalChannel;
        #endif /* ((ADC_NCMR2_AVAILABLE == STD_ON) || (ADC_JCMR2_AVAILABLE == STD_ON)) */
#endif
    }
}
#endif /* ADC_CMR_REGISTER_NOT_SUPPORTED */

#ifdef ERR_IPV_ADC12B_LBA_0001
#ifdef ADC_WORK_AROUND_ERRATA_E8188
#if (ADC_WORK_AROUND_ERRATA_E8188 == STD_ON)
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_StopCurrentWorkAround(void)
{
    Adc_Ipw_StopCurrentWorkAround();
}
#endif
#endif
#endif

#define ADC_STOP_SEC_CODE
/** @violates @ref Adc_c_REF_1 Only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_c_REF_6 Repeated include file MemMap.h*/
#include "Adc_MemMap.h"

#ifdef __cplusplus
}
#endif

/** @} */
